[
{"title": "Тамагочи в качестве ключа для домофона и проездного в метро", "text": ["В видео показан способ превращения тамагочи в домофонный ключ и проездной для общественного транспорта.В итоге мы получаем двухдиапазонный ключ на 125 кГц и 13 МГц.", "В качестве низкочастотного чипа используется перезаписываемый", ".", "Вместо проездного можно использовать любой высокочастотный чип, например mifare zero для записи на него студенческой карты.", "По началу мне хотелось открывать домофон вообще без модификации железа, так как протокол его очень похож на em4100.", ".", "Но для этого требовалось модифицировать прошивку, а как это сделать никто пока не выяснил.", "Вот, кстати, блог посвященный реверсингу Тамагочи", "Его автор сотрудица Google из Android Secuiry Team.", "Она смогла взломать тамагочи модели TamaTown Tama-Go и даже сделала программатор для него:", "Я решил поступить крайне просто и припаять чип к родной антенне.", "Проще всего достать чип T557 получилось из домфонного брелка разломав его плоскогубцами.", "Я ожидал что припаянный напрямую в родной антенне чип может вызвать проблемы с беспроводными функциями тамагочи, но этого не произошло. И домофон и тамагочи работали отлично. Разве что в момент активированной функции Bump (ожидание соединения с другим тамагочи) домофон открыть нельзя. Но это не проблема.", "Намного сложнее дело обстояло с высокочастотной частью. Смонтировав обе антенны в корпус обнаружилось что проездной не читается. Пришлось долго играться с положением меньшей антенны чтобы чтобы он заработал.", "Извелечение чипа из карты Тройка тоже оказалось непростой задачей, за время съемок ролика было сломано две штуки.", "Поплнять проездной можно по номеру через интернет", ".", "Или в терминалах которые позволяют просто приложить карту, как у Мегафона и МТС.", "Итоговая схема выглядит так:", "Ссылки:", "Группа Tamagotchi Friends Вконтакте", "Блог про реверсинг Тамагочи", "Инструмент для исследования RFID proxmark3"]},
{"title": "Удаленная инъекция Wi-Fi кадров", "text": ["Стандарт WiFi 802.11n использует механизм агрегации кадров для уменьшения накладных расходов при передаче данных.", "Для этого несколько кадров объединяются в один. При этом маркер разделителя кадров передается вместе с данными.", "Это позволяет сформировать данные, которые при прохождении через WiFi устройство будут интерпретированы им как отдельные кадры.", "То есть имея контроль над потоком данных передаваемых от сервера клиенту (например при загрузке файла с сервера атакующего) или от клиента к серверу, можно генерировать произвольные пакеты на всех уровнях OSI:", "Уязвимости подвержены", ".", "Как видно разделитель кадра (A-MPDY delimiter) помещается прямо в payload с пользовательскими данными, поэтому при получении такого кадра принимающей стороной, будет произведена деагрегация и наша последовательность будет воспринята операционной системой как отдельный пакет.", "Подробнее об уязвимости можно прочесть в докладе", "Код для эксплуатирования уязвимости", "Скрипт, генерирующий payload — aggr-inject.py.", "Для инъекции фреймов от точки доступа к клиенту предлагается сгенерировать jpg файл, который будет скачивать жертва (как на картинке в заголовке поста). В обратную сторону, от клиента к точке предлагается посылать специальный сформированный POST запрос на веб-сервер атакующего.", "Тип передаваемых данных не имеет никакого значения, достаточно иметь возможность создать управляемый атакующим поток данных. В данном случае взят HTTP как самый простой пример. При этом важно, чтобы данные были переданы в неизменном виде на сам wifi чип, поэтому данные должны быть переданы по открытому каналу (HTTPS не подходит), не подвергаться обработке, сжатию.", "Самый простой пример демонстрации уязвимости: посылка широковещательных beacon фреймов. Маяков, которые посылает точка доступа, сообщая о своем имени сети (SSID).", "Файл, инъецирующий маяки с именем сети «injected SSID»", "Скорее всего, вы не увидите новую сеть в списке доступных для подключения WiFi сетей, так как большинство операционных систем используют активное сканирование, и показывают только сети, ответившие им на probe request. Поэтому чтобы увидеть инъекцию пакетов нужно использовать пассивное сканирование.", "Кстати, на заметку тем, кто используется Mac OS, можно дампать WiFi трафик родной картой airport. Рекомендую для этого мою тулзу", ". Дамп можно будет найти в /tmp/airportXXXX.cap", "Мой тестовый стенд идентичен картинке в заголовке поста. Вредоносный файл скачивается планшетом, дампер запущен на ноутбуке, подключенном к той же точке доступа TL-MR3020 с прошивкой openwrt 12.09. Также инъекция успешно воспроизводится с использованием USB адаптера tl-wn821n.", "Вот как выглядят пойманные ноутбуком пакеты:", "По таймингам видно, что инъекции происходят очень бодро.", "Для того чтобы провести реальную атакую необходимо подниматься на L2 и L3 уровни, то есть нужно знать MAC адрес точки доступа, в некоторых случаях MAC адрес клиента, IP адреса клиентов за NAT. Поэтому эксплуатировать уязвимость в реальных условиях крайне сложно. Максимум — это посылать deauth пакет и отключать всех клиентов от сети.", "Мне удалось успешно провести инъекции TCP пакетов и я попытался пролезть на TCP порт клиента, находящегося за NAT, пытаясь создать в nf_conntrack трансляцию, пропускающую мои пакеты клиенту. Но у меня так и не получилось. Если послать клиенту SYN от имени удаленного хоста, его ответ SYN-ACK не создает трансляцию и ответить ему из мира нельзя. Если же послать от клиента SYN в мир и ответить ему, пусть даже создав трансляцию на роутере в состоянии ESTABLISHED, новый SYN из мира посланный клиенту будет отброшен. Даже фантазии на эту тему разбились о проблему с угадыванием seqence number. Хотя, может быть, я просто лошара и у вас получится.", "Подобное можно успешно провернуть с UDP. Также в примерах есть способ сканировать хосты за NAT, посылая icmp."]},
{"title": "Linux в одном файле для Macbook", "text": ["Можно уместить полноценный Linux Live дистрибутив в один файл, если вкомпилировать в ядро initramfs с корневой файловой системой. Компьютеры с UEFI умеют загружать такой файл напрямую, без помощи загрузчика типа GRUB. У меня получилось уместить дистрибутив с программами", "и драйверами для карт Wi-Fi в файл размером", "(наверняка можно еще меньше).", "Для всех случаев, когда нужен нативный Linux без виртуальной машины.", "Чтобы использовать PCIe-устройства в Linux, когда их нельзя прокинуть в виртуальную машину. Например, встроенную Wi-Fi-карту для инъекции пакетов. Когда лень устанавливать виртуальную машину и качать большой ISO файл с дистрибутивом. Когда не хочется возиться с USB флешками.", "Единожды скопированный файл позволит всегда иметь под рукой дистрибутив Linux, который переживет даже переустановку системы.", "Все команды нужно выполнять из macOS.", "Конфигурация загрузки не имеет значения, способ не нарушает работу BootCamp, rEFInd и любых других нестандартных конфигураций. Поддерживаются компьютеры Mac не старше 2009 года (работоспособность на более старых не проверялась, но может и заработать).", "Теперь каждый раз, когда вам потребуется загрузить OneFileLinux.efi, достаточно выполнить шаги 2 и 4 в консоли Recovery, или из основной системы, если SIP выключен.", "Вариантов загрузки на PC множество. Если ваша материнская плата имеет встроенный UEFI Shell, достаточно в нем указать путь к файлу OneFileLinux.efi, чтобы единожды загрузиться в Linux. Я опишу процесс настройки на моем Thinkpad X220.", "Исходники проекта", "Дистрибутив собран на чистом ядре", "с kernel.org и Alpine Linux", ".", "Его можно легко собрать самостоятельно.", "Initramfs — это образ диска, который монтируется в памяти при загрузке ядра. В обычных дистрибутивах в него помещаются драйвера, требующиеся на раннем этапе загрузки. В него можно поместить полноценную корневую файловую систему.", "Я использовал корневую файловую систему от Alpine Linux. Это минималистичный дистрибутив для встраиваемых систем и контейнеров. У него существует вариант поставки без ядра и предустановленных программ, только корневая файловая система на базе busybox и пакетный менеджер", ".", "chroot-имся в alpine linux:", "Находясь внутри окружения, можно внести нужные изменения. Добавить пакеты через «apk add», модифицировать сервисы используя openrc.", "Вся необходимая информацию есть в", ".", "Запустить скрипт сборки. Он соберет модули ядра, поместит их в initramfs, и соберет ядро.", "На данный момент дистрибутив достаточно кривой. Если вы умеете линуксы, я буду очень признателен за любую помощь. Будет круто, если получится допилить этот проект до приемлемого уровня.", "Известные проблемы:", "Приглашаю всех коммитить и создавать issues о проблемах", "."]},
{"title": "Странности реализации Wi-Fi в метро Москвы", "text": ["В начале 2015 года в московском метро полностью запустился бесплатный Wi-Fi. Я отправился протестировать его и обнаружил некоторые странности. Например, зачем-то был сломан редирект на captive portal на iOS-устройствах. Дело в том, что при подключении к Wi-Fi, устройства на iOS и десктопной MAC OS отправляют  HTTP GET запросы на свои сайты, чтобы проверить, нет ли редиректа. Запросы отправляются с User-Agent", "При этом каждый раз подставляя рандомный URI.", "Типичный запрос выглядит так:", "Система обращается по адресам:", "В ответ ожидается строка «Success». Если содержимое страницы отличается от ожидаемого, система считает, что в сети есть заглушка и открывает ее поверх всех окон.", "Почему-то эти запросы специально перехватываются, чтобы система считала, будто редиректа нет."]},
{"title": "Двухэтапная аутентификация в браузере с помощью USB-токена U2F", "text": ["U2F — открытый протокол универсальной 2-факторной аутентификации, разработанный", ".", "В альянс входят компании Google, PayPal, Lenovo, MasterCard, Microsoft, NXP ,Visa и другие.", "Протокол поддерживается браузером Chrome с версии 38. Работает из коробки без драйверов в Windows/MacOS/Linux.", "На текущий момент поддерживается сервисами", ".", "В статье описывается опыт использования токена Yubikey NEO с поддержкой NFC и OpenPGP card, недостатки двухфакторной аутентификации по SMS.", "Сейчас очень популярна двухэтапная аутентификация при помощи SMS или звонка.", "Безусловно, это удобно, и такая дополнительная проверка в большинстве случаев эффективна. Для защиты от автоматизированных атак, фишинга, подбора паролей, вирусов, восстановления утраченного доступа и прочего.", "Но в случае, если ваша персона стала мишенью профессиональных мошенников, привязанный телефон может сыграть роковую роль. Чаще всего телефонный номер, к которому привязан аккаунт не является секретом, обычно это основной контактный номер. Почти все сервисы сообщают его первые или последние цифры любому желающему, если попытаться восстановить доступ к аккаунту. Поэтому выяснить номер связанный с аккаунтом несложно.", "Узнать, на кого оформлен номер в России не составляет большого труда. Достаточно почитать", "ребят из Roem.ru.", "Получив персональные данные владельца номера, мошенники рисуют поддельную доверенность, водительские права или паспорт, и отправляются в ближайший филиал оператора сотовой связи.", "Полномочия перевыпустить SIM-карту имеет любой рядовой сотрудник самого захудалого салона мобильной связи.", "Забавно, что у большинства операторов в профиле абонента нет даже фотографии владельца номера, хотя паспорт они зачем-то ксерят. То есть достаточно нарисовать паспорт с совпадающими реквизитами и вклеить подходящую фотографию.", "У операторов есть опция запрета перевыпуска SIM-карты по доверенности, однако это иллюзорная защита, потому как номера успешно перевыпускаются по поддельным водительским правам и паспортам.", "В Украине ситуация еще хуже, так как большинство номеров анонимны.", "У оператора Kyivstar для перевыпуска SIM-карты требуется показать чек последнего пополнения счета и назвать три номера, на которые совершались звонки.", "Хорошие сервисы, например, многие банки, сохраняют вместе с телефонным номером еще и", "(International Mobile Subscriber Identity) — уникальный идентификатор SIM-карты. В случае, если IMSI изменился, то привязка номера считается аннулированной и процедуру привязки нужно пройти заново.", "К сожалению, таких сервисов не очень много.", "Проверить IMSI любого номера можно с помощью HLR-запроса", "Рецепт для параноиков: у smsc.ru есть удобные библиотеки для Python, PHP, Perl, Ruby, Java, C#, Delphi, C++, позволяющие, в том числе, посылать HLR-запросы. Можно проверять IMSI своих номеров, например, два раза в сутки, и в случае его изменения бить тревогу. При самом дорогом тарифе один запрос стоит 0.2 рубля, выходит примерно 150 рублей в год за один номер. Через эту же библиотеку можно послать SMS с тревогой. Рекомендую ;)", "Существуют и другие способы обхода подтверждения через мобильный телефон, такие как установка переадресации, перехват голосовой почты и т.д. Но их описание выходит за рамки данной статьи.", "По задумке U2F аутентификатором выступает аппаратный модуль: USB-токен, SIM-карта или NFC брелок, который хранит ключи и самостоятельно выполняет криптографические операции. При этом ключи предустановлены при производстве и никогда не покидают токен.", "Принцип работы таков:", "На текущий момент поддержка U2F есть в Google Chrome, начиная с 38 версии. Вероятно, в ближайшее время будет добавлена в FireFox.", "Уже поддерживается для авторизации в аккаунтах Google и Lastpass, есть плагин для Wordpress, Django и библиотеки на разных языках.", "Модули для Linux PAM, OpenSSH и прочего.", "Таблица сервисов поддерживающих OTP/U2F авторизацию —", "Самые продвинутые U2F устройства производит компания Yubico.", "Дистрибьютор в России —", "Я купил самый навороченный на текущий момент брелок — Yubikey NEO.", "Помимо U2F он умеет:", "По дефолту устройство работает в режиме Yubico OTP (фирменный протокол одноразовых паролей), определяется только как HID-клавиатура и по нажатию на кнопку печатает одноразовые пароли на основе ID устройства.", "Включить режим U2F нужно через фирменную утилиту, которая есть под Windows/Mac/Linux.", "Я предпочел включить режимы U2F и ICCID для работы в качестве OpenPGP карты.", "На этом все. U2F сразу работает, никакие драйвера устанавливать не требуется.", "Проверить работу можно в демо-приложении", "Привязка токена к Google-аккаунту происходит крайне просто:", "После привязки токена он становится вторым фактором по умолчанию, при этом нельзя отключить альтернативный способ: либо SMS, либо TOTP.", "Альтернативным вторым фактором я выбрал TOTP. Я использую", "через 1Password (то же, что и Google Authenticator, только на десктопе). Yubikey NEO тоже умеет TOTP, при этом ключ для генерации паролей сохраняется в токене и не может быть извлечен. Но так как пароли генерируются на основании времени, нужно держать запущенным программный апплет для передачи времени в токен, что мне не понравилось.", "Я также бегло исследовал другие функции устройства.", "сразу заработала с GnuPG 2.0.27 из пакета gpgtools.org.", "Карта версии 2.0, ключи только RSA и не длиннее 2048 бит.", "Работа с картой возможна и через NFC, например, на Android с помощью", ". Прелесть такой связки в том, что все операции с закрытым ключом выполняются на карте, ключ никогда не покидает карту и не может быть извлечен из нее.", "К сожалению, на днях была", "в реализации OpenPGP в Yubikey NEO, позволяющая обойти ввод пин-кода и выполнить операцию с приватным ключом. И, так как обновление прошивки на устройствах запрещено из соображений безопасности, исправить баг нет возможности. Компания Yubico обещает заменить кривые железки всем желающим.", "У меня как раз оказалась уязвимая версия прошивки 1.0.8", "— самая непонятная для меня функция. При попытке общаться с ней, как с обычным Mifare Classic, карта ведет себя странно.", "Карта имеет 7-байтный UID", "Физически RFID-метка работает довольно хорошо, несмотря на маленькую антенну, ридер в метро «схватывает» с 3 сантиметров.", "По сравнению со всеми аппаратными токенами, которыми мне доводилось пользоваться, технология U2F — это крайне удобно. Не нужно возиться с импортом сертификатов, установкой драйверов, никаких Java-апплетов и прочего.", "Я протестировал работу на Windows 7, Mac OS 10.10 и Ubuntu 14.0.4. Во всех системах Chrome сразу подхватывал токен без установки драйверов. В целом, развертывание видится настолько простым и понятным, что справится даже ребенок.", "А наличие полностью открытых спецификаций, плагинов и библиотек позволит прикручивать U2F к любым приложениям."]},
{"title": "Как держать 20 тысяч VPN клиентов на серверах за $5", "text": ["Месяц назад мы с друзьями сделали бесплатный сервис для обхода блокировок сайтов в Украине", ". За это время сервис стал довольно популярным, аудитория выросла до 20 000 пользователей. Число одновременных подключений в пиковые часы — ≈6 000 клиентов.", "Главная особенность нашего сервиса в том, что через VPN маршрутизируется трафик только к заблокированным сетям, остальные сайты работают напрямую. Это не влияет на скорость интернета и не подменяет IP-адрес для остальных сайтов.", "В статье описываются тонкости настройки OpenVPN для большого числа клиентов, на дешевых VPS.", "Наш опыт будет полезен для тех, кто собирается развернуть VPN для личных нужд, и тех, кто хочет создать сервис с большим числом клиентов.", "Поначалу мы использовали несколько серверов в Европе у провайдеров Scaleway, Linode, DigitalOcean. Это были самые дешевые VPS, за $3-5. Сразу же пользователи начали жаловаться, что из-за европейских IP-адресов Яндекс.Музыка и музыка VK.com недоступна. Мы начали искать подходящий хостинг в СНГ.", "Оказалось, что отечественных хостеров, сравнимых по уровню услуг с европейскими, не существует. Почти всегда это низкое качество услуг при высокой цене, сложная процедура заказа, устаревшие технологии. За время поиска мы успели сформировать список отличительных черт плохого хостинга.", "Попробовав несколько хостингов, мы почти отчаялись. Казалось, что в России просто не существует нормального хостинг-провайдера для наших нужд. Я разослал письмо всем хостерам, которых смог найти на сайтах-агрегаторах хостинга, в котором описал наши требования, и попросил бесплатно предоставить нам площадку в обмен на рекламу на нашем сайте.", "На наш запрос откликнулось около десятка компаний, но почти все из них имели признаки убогого хостинга и не подходили. В результате мы-таки нашли", "хостинг-провайдера, удовлетворяющего всем нашим нуждам.", "Это звучит странно, но я готов аргументированно доказать в комментариях, что 99% отечественных хостеров — фуфло, недотягивающее до уровня Европы. Особенно буду рад пообщаться с представителями крупных компаний, вроде МастерХост, REG.ru, 1GB.ru, Timeweb.", "Настоящим открытием для нас стал хостер", "с датацентром в Санкт-Петербурге. Это единственный хостер, который знал как правильно готовить IPv6. На каждый VPS сервер выделяется сеть /64 и по запросу /56.", "У них есть две линейки тарифов VPS. Мы используем тариф", ", с безлимитным трафиком. Сервера на этом тарифе имеют процессор Intel Xeon X5650. Также есть линейка тарифов", ", с SSD диском, мощным процессором Intel Xeon E5v4 и памятью DDR4.", "Панель управления сравнима по удобству с DigitalOcean. Есть даже оплата через Bitcoin!", "На текущий момент мы полностью переехали на площадку Veesp.com и используем шесть серверов Storage 1 для OpenVPN. Музыка в VK и Яндексе снова работает, пользователи довольны.", "Я очень люблю IPv6. Он позволяет избавиться от кучи ненужных сущностей, вроде NAT и проброса портов. Для VPN он удобен тем, что каждый клиент ходит в интернет со своим реальным IP-адресом. К сожалению, многие хостинг-провайдеры и системные администраторы противятся и недолюбливают этот протокол, из-за этого его неправильно настраивают и используют.", "Самая распространенная ошибка — выдавать один IPv6-адрес на сервер.", "Сайт", "посвященный этому заблуждению.", "Чтобы выдавать клиентам VPN IPv6-адреса напрямую без костылей, нужно иметь отдельную маршрутизируемую сеть через IPv6-адрес на сервере, то есть подсеть, из которой планируется раздавать адреса клиентам, не должна быть назначена на интерфейс сервера, но должна маршрутизироваться через какой-либо адрес на сетевом интерфейсе сервера.", "Существует два распространенных варианта раздачи маршрутизируемах сетей.", "Первый вариант: одна /64 на сетевом интерфейсе, и /56, маршрутизируемая через первую /64. Вы можете побить /56 так, как вам хочется, либо же назначить всю /56 на интерфейс VPN.", "Второй вариант: одна или несколько /64 (или больше), маршрутизирутизируемая через link-local-адрес.", "У большинства хостеров выделенную сеть нужно заказывать отдельно.", "выдает блок /56 на каждый сервер бесплатно. К сожалению, даже продвинутые хостеры, вроде DigitalOcean, не предоставляют такой услуги. Здесь есть список хостеров, предоставляющих данную услугу", ", от @rm.", "На серверах забороны больше двух сотен правил iptables, по несколько на каждый диапазон", ".", "Сложный набор правил неудобно обслуживать стандартными средствами", "и", ", потому что в случае изменения одного правила, необходимо будет редактировать сотни однотипных строк.", "— утилита для управления сложными правилами iptables со своим синтаксическим сахаром. Она позволяет создать удобочитаемую конфигурацию iptables, использовать переменные, массивы и циклы, но не ограничивает вас, в отличие от других надстроек над iptables: вы можете делать абсолютно все, использовать все возможности и модули netfilter.", "Простой пример: мы хотим заблокировать входящие соединения из нескольких тысяч сетей на трех сетевых интерфейсах eth0, eth1, eth2. В обычном случае нужно было бы написать тысячи одинаковых правил для каждого интерфейса.", "Вот как эта задача решается через ferm:", "В результате будет создано правило для каждого адреса из $BLOCKED_NETWORKS на каждый сетевой интерфейс. Такая запись легко читается и занимает в три раза меньше строк. Ее проще редактировать.", "В нашем случае iptables выполняет три функции: NAT для IPv4-соединений, ограничение доступа в другие сети и балансировка нагрузки между процессами OpenVPN. Разберем каждую задачу подробно.", "Клиентам выдается «серый» IP-адрес из диапазона 192.168.*.*, поэтому маршрутизировать его напрямую в интернет нельзя. Для того, чтобы выпустить клиентов в IPv4-интернет, нужно использовать", ".", "Тем же самым занимается ваш домашний WiFi-роутер. На каждое исходящие соединение клиента создается трансляция в памяти сервера, которая хранит информацию о том, кому какое подключение принадлежит. Несмотря на то, что эта операция требует мало ресурсов сервера, при огромном количестве подключений (десятки тысяч), это может стать ресурсоемкой задачей для слабого сервера.", "Этой проблемы нет в IPv6, так как каждому VPN-клиенту выдается реальный IP-адрес, который напрямую маршрутизируется в интернет. Серверу остается только перебрасывать пакеты с одного интерфейса на другой, без создания трансляций и хранения информации о каждом подключении.", "Любой пользователь может добавить опцию", "в конфиг OpenVPN и использовать наши сервера как маршрут по умолчанию. Нужно закрыть доступ ко всем сетям, кроме заблокированных в Украине.", "Архитектура OpenVPN однопоточная, поэтому один процесс демона OpenVPN использует только одно ядро процессора. Для лучшей утилизации всех ядер процессора, число процессов должно равняться количеству ядер на сервере. Балансировка между процессами выполняется с помощью модуля", ", который случайном образом перенаправляет входящие подключения на разные внутренние порты.", "Мы используем самый простой способ балансировки — с помощью множественных А-записей DNS. Все клиенты подключаются к серверу через доменное имя", ". Этот домен имеет шесть А-записей, которые направлены на все сервера. В итоге, в момент подключения, клиент выбирает случайный сервер из доступных. Так общее число подключений равномерно распределяется между всеми серверами. Конфигурация OpenVPN на всех серверах идентична, за исключением диапазонов IPv6-адресов, выдаваемых клиентам.", "Можно быстро посмотреть, на какие IP-адреса резолвится домен из разных точек планеты, с помощью сервиса", ", выбрав любой из тестов, например http или ping.", "Результат для домена vpn.zaborona.help:", "Многие украинские провайдеры блокируют DNS-запросы к запрещенным доменам, перехватывая запросы в том числе и к сторонним DNS-серверам, вроде 8.8.8.8. Поэтому важно, чтобы клиенты посылали DNS-запросы через VPN тоннель, где их не сможет модифицировать провайдер.", "Это не так просто сделать, потому что в новых версиях Windows запросы могут уходить ко всем DNS-серверам в системе, и будет использоваться тот, который ответит быстрее. DNS-сервер провайдера находится физически ближе к клиенту, поэтому, с большой вероятностью, система быстрее получит подмененный ответ провайдера, а не корректный ответ DNS внутри VPN, и сайт останется заблокирован.", "Для решения этой проблемы", "написал", ". Он использует Windows Filtering Platform — специальный слой файрволла Windows, позволяющий блокировать запросы к сторонним DNS, пока запущен OpenVPN.", "В комментариях к предыдущей статье меня упрекали в том, что некоторые этапы, которые мне казались очевидными, не описаны. Здесь я опишу полный набор команд для разворачивания сервера забороны.", "Конфиги максимально унифицированы и могут быть без изменений развернуты на сервере. Это удобно при использоватии инструментов автоматического деплоя, вроде Ansible.", "Единственное уникальные данные для каждого сервера — подсеть IPv6, подписанная в конфигурационном файле OpenVPN.", "На серверах используется", "с ядром 4.4.0.", "В репозитории дистрибутива содержится устаревшая версия OpenVPN 2.3, поэтому добавляем официальные репозитории проекта с OpenVPN 2.4. Все остальные пакеты ставим из стандартной поставки.", "Так как все сервера настроены идентично, просто копируем конфиги вместе с файлами ключей и сертификатам в папку", ". Никакой генерации ключей/сертификатов не выполняется. Число процессов OpenVPN настраивает по числу ядер на сервере, в нашем случае 2. Каждый отдельный процесс имеет свой конфиг: zaborona1.conf и zaborona2.conf.", "Чтобы избежать путаницы, я буду называть процессы OpenVPN демонами, но сути это несколько отдельных серверов, запущенных внутри одного VPS.", "Список файлов в", "Содержимое файлов:", "Конфиги разных демонов отличаются только номером порта для входящих соединений и диапазоном IP-адресов, выдаваемых клиентам.", "Первое время мы постоянно реадктировали список заблокированных сетей, из-за этого приходилось перезапускать демоны OpenVPN каждый раз при изменении конфигов. Из-за этого у клиентов разрывалось подключение к серверу.", "Решением этой проблемы стала опция", ". Она используется для того, чтобы назначит индивидуальные настройки поименно каждому пользователю. Так как у нас все пользователи подключаются от имени одного клиента", ", то файл один на всех <", ". Хитрость в том, что файл перечитывается заново при каждом подключении клиента и не требует перезапуска сервера для применения настроек.", "В результате мы можем редактировать настройки сервера без отключения клиентов. и для преминения новых настроек пользователю достаточно переподключиться к серверу. Так как пользователи рано или поздно в любом случае перподключаются, новые настройки со временем применяются всем клиентам.", "Настройки фаерволла идентичны на всех серверах, поэтому копируем файл /etc/ferm/ferm.conf без изменений. По-умолчанию, после установки, пакет ferm сразу активирует стандартный набор правил в котором запрещены все соединения, кроме SSH на 22 порту. Так что если у вас SSH сервер находится на другом порту, будьте аккуратны, чтобы не заблокировать себя.", "Для сравнения, вот как выглядит тот же набор правил, полученный через iptables-save:", "Балансировку между демонами выполняет это правило:", "С 50% вероятностью подключения к порту 1194 перенаправляются на порт 1195. Так, подключения равномерно распределяются между двумя процессами OpenVPN. Если бы процессов было больше, нужно было бы добавить дополнительные правила на каждый процесс и изменить вероятность срабатывания каждого правила.", "По-умолчанию dnsmasq принимает запросы только с локального интерфейса 127.0.0.1, поэтому разрешаем запросы с адресов VPN клиентов и устанавливаем размер DNS-кеша.", "Файл systctl.conf с настройками ядра. В нем включаем форвардинг IP-пакетов и другие опции для оптимизации системы под VPN сервер.", "После того, как все сервисы настроены, можно добавить их старт в автозагрузку.", "Предварительно увеличиваем лимит на число открытых файловых дескрипторов для процессов OpenVPN, иначе при большом числе клиентов мы их превысим и получим ошибку", "из-за большого числа открытых сокетов.", "Для проверки корректности настроек, можно перезагрузить сервер и убедиться что все сервисы запущены.", "У значительной доли пользователей оказались устаревшие, сломанные ОС. Очень часто в системе сломана поддержка IPv6, например во многих сборках Windows 7 «от Васяна с rutracker», где отключены автоматические обновления системы. Мы завели", "на Github, в которую пользователи самостоятельно могут добавлять инструкции. Там описаны решения некоторых распространенных проблем.", "Вот наиболее типичные случаи кривого пользовательского окружения:", "Несмотря на то, что поддержка этой OC закончилась ВОСЕМЬ лет назад, ее по-прежнему используют. На ней не работет много современных программ, веб-браузеры, а также последняя версия OpenVPN 2.4. Этой теме посвящена", ".", "У многих пользователей отключены автоматические обновления Windows. Почему-то, в такой конфигурации на Windows 7 часто ломается IPv6. При подключении в логах OpenVPN появляется такая ошибка:", "Причину этой аномалии не удалось выяснить. Зато у Microsoft есть специальная утилита на такой случай —", ". Ссылка на скачивание внизу с подписью", "Каждый вендор ломает VPN Framework в Android по-своему. Многие сборки Android имеют проблемы, которые не поддаются объяснению, например часто жалуются на то, что при подключенном VPN DNS запросы выполняются по несколько секунд. В Android 4.4 полностью", ".", "В RouterOS есть поддержка OpenVPN. К сожалению она чаще не работает, чем работает. Статья посвященная", ".", "Мы отказались ломать наши сервера, чтобы сделать их совместимыми с багами Mikrotik, и предложили пользователям писать баг-репорты в компанию Miktorik. В результате было выпущено несколько исправлений в версии RouterOS 6.40rc24.", "Хотя по сообщениям пользователей, проблема так и не решена полностью. Советую всем заинтересованным лицам продолжить отправлять баг-репорты в Mikrotik до полного решения проблемы."]},
{"title": "DoS эксплойт десктопного Skype для Windows и Mac OS", "text": ["В последних версиях Skype для Windows и Mac OS X и присутствует ошибка, позволяющая безвозвратно обрушить программу.", "Для этого достаточно отправить в чате строку:", "После чего Skype вылетает и больше не запускается.", "Работает как в групповых чатах, так и в приватных.", "Уязвимые версии:", "для Windows:", "для Mac OS X:", "Более старые версии Skype, например Windows", "и Mac OS", "не подвержены проблеме. В качестве временного решения можно откатиться на более старую версию.", "Проблема исправлена в версии 7.5.64.102 для Windows и 7.8 (391) для Mac OS.", "В свежем апдейте для Mac OS X", "проблему воспроизвести не удалось.", "Скайп начал фильтровать сообщения, теперь при отправке зловредного сообщения оно удаляется не доходя до адресата. Однако старые сообщения по-прежнему вызывают проблему. Строку также можно поместить в статус, тогда никакое удаление истории не помогает."]},
{"title": "Определение IP адреса пользователя Skype", "text": ["Вводим логин — получаем IP:", "Поиск происходит абсолютно незаметно для юзера.", "Слева внешний IP через который клиент выходит наружу, справа локальный.", "Если они совпадают значит у пользователя не используется NAT.", "Если запущено одновременно несколько клиентов — будут показаны все.", "Если возвращается только локальный IP вида 10.* или 192.168.* значит используется старая версия клиента, например Linux 2.0.0.72", "IP показываются еще спустя несколько часов после того как пользователь отключился.", "По мотивам этого поста", "В", "вылеченном SkypeKit, о котом шла речь здесь", "отладочные логи также не шифруются.", "Схема работы проста: враппер на python слушает unix-сокет в ожидании логина, после получения выполняет для него метод RefreshProfile() и в логе появляются искомые строки которые парсятся с помощью php.", "Исходники демона", "Из-за большого наплыва Skypekit долго ищет, так что если ничего не нашло, пробуйте повторить запрос через пол минуты."]},
{"title": "Skype просматривает содержимое ссылок отправленных в чате", "text": ["Вернее обходит все HTTPS ссылки отправленные в чате HEAD-запросом.", "Шаги для воспроизведения:", "1. Отправляем в чате ссылку с https которая ранее через Skype не отправлялась", "2. Через 10-40 минут наблюдаем HEAD запрос в access логе из сети 65.52.0.0/14 принадлежащей Microsoft. Запрос приходит без User-Agent.", "Выдержка из", "гласит:", "На основании этого, я думаю, нельзя утверждать, что скайп более не использует шифрование точка-точка между клиентами. Вполне возможно, что новые версии клиента сами отправляют ссылки.", "Более подробные материалы по теме:"]},
{"title": "SkypeKit вылечен от жадности", "text": ["Есть такая замечательная штука как Skypekit. В двух словах это полноценный Skype без GUI, обёртку для которого предполагается написать самому.", "Теоретически на основе Skypekit можно было бы:", "и многое другое, если бы не условия использования.", "Во-первых, для того чтобы скайп позволил вам распространять свой продукт нужно заплатить овер 9000$ за сертификацию вашего продукта. Во-вторых, сертификат в любой момент может быть отозван, если скайп решит что вы нарушаете условия использования.", "Но благодаря целебному воздействию реверс-инжиниринга этот недуг удалось вылечить.", "Подробно о том как распространяется Skypekit можно прочитать здесь", "Каждый runtime компилируется индивидуально и отождествлен с вашей зарегистрированной организацией. Ему присваивается уникальный номер версии и ключ. Впоследствии, авторизовываться через этот runtime можно будет только с помощью выданного специально для него ключа. На время разработки выдается Developer ключ, с помощью которого можно авторизовываться только аккаунтам состоящим в вашей организации.", "Ключи бывают двух типов:", "Developer — можно логиниться только с аккаунтов состоящих в группе разрабочиков (действует 60 дней)", "Distribution — можно логиниться всем.", "Доступ к API происходит через TCP-сокет на локалхосте. Для этого открывается SSL-тоннель, который шифруется с помощью выданного ключа.", "Поэтому даже снифером на локалхосте нельзя посмотреть о чем общается враппер с рантаймом.", "Skype требует, чтобы готовое приложение было обфусцированно и распространялось в бинарном виде, чтобы нельзя было вытащить ключ и использовать рантайм отдельно.", "Рантайм может понять (расшифровать) SSL только зашифрованным ключом из своей организации. Отдельно рантайм и ключ из разных организаций бесполезны.", "Поэтому ценность представляют пара ключ и runtime.", "Если в какой-то момент компания Skype решит, что вы более не достойны использовать Skypekit (например, совершили страшное преступление — публикацию исходников своей программы), ключ может быть отозван в одностороннем порядке и через вашу программу нельзя будет авторизоваться в сети Skype.", "По обыкновению все программы от Skype имеют защиту от реверс инженеринга: код обфусцирован, используются ловушки для препятствия дизассемблированию. Skypekit не исключение.", "Но однажды, подобно чуду схождения благодатного огня в Иерусалиме, обфускация рантайма спала.", "При сравнении двух расшифрованных рантаймов одной версии, скомпилированных для разных владельцев, было выяснено, что отличаются они незначительно. Внутри файла содержится временная метка сборки и пароль RSA-ключа, которым шифруется локальное подключение к рантайму.", "Оказалось, что выдаваемый ключ участвует только в создании локального SSL-тоннеля для доступа враппера к API рантайма, а на сервер авторизации отправляется лишь строка версии, содержащая отпечаток ключа:", ".", "По этому отпечатку сервер авторизации определяет какой используется ключ и на основании этого решает можно ли авторизовывать клиента.", "Экспериментально было установлено, что можно подставить в эту строку отпечаток одного ключа, а подключаться к рантайму с помощью другого. Сервер авторизации реагирует согласно тому ключу, который передается в строке версии.", "Например, используя для локального SSL-тоннеля Developer ключ, а в строке версии посылая фингерпринт от Distribution ключа, удалось авторизоваться аккаунтом не состоящим в организации.", "Оказалось, что если подменить строку версии, указав версию от обычного десктопного клиента, никакой проверки происходить не будет вовсе.", "Это наглядная иллюстрация несостоятельности модели", ".", "Больше ничего.", "Сертификат нужен для установления локального SSL-тоннеля, он оставлен для совместимости с SDK.", "Он был выковырен из Trillian и помещен в последнюю версию. Сертификат бессрочный поэтому так проще всего. Даже если он будет отозван, дальше локалхоста он не проверяется, так что это не заблокирует рантайм.", "Не легально, не безопасно.", "Нет полной уверенности в том, что фингерпринт в строке версии единственный способ верификации. Существует риск лишиться аккаунта при авторизации через такой рантайм, поэтому на время тестирования лучше не использовать свой постоянный Skype-аккаунт.", "Это по-прежнему бинарный проприетарный Skype, хоть и не обфусцированный. Нельзя гарантировать что он не содержит недокументированных функций, поэтому я советую", "По поводу легальности — это стопроцентный варез со всеми вытекающими.", "Запрещено распространять сам runtime, сертификат и SDK.", "Свой собственный код для работы со Skypekit распростронять можно. При этом происхождение рантайма и сертификата может быть любым, никто не запрещает пользователю купить рантайм за 5$ и выписывать себе 60-дневные Developer-сертификаты для личного использования.", "Например, популярная программа Audacity при установке сообщает, что для поддержки mp3 нужно самостоятельно найти библиотеку LAME. Такой подход вполне легален.", "Вылеченный рантайм пока есть под Windows и x86_Linux.", "Существует вероятность, что чудесное исцеление постигнет и версию под Mac и ARM Linux", "Skypekit в основном предназначен для интеграции в устройства.", "Например:", ",", ",", ".", "Эти устройства уже лицензированы и продаются. Изменение протокола поломает их все. Поэтому вероятность того, что Skype это сделает в обозримом будущем, крайне мала.", "Спамить можно было и раньше через Desktop API.", "По дефолту настройками приватности запрещено принимать сообщения и звонки от неавторизованных контактов. Поэтому, как и раньше, спамить можно только запросами авторизации с сопроводительным текстом.", "Точно не знаю, но есть какая-то намагниченная ссылка", "Конечно это не полноценное решение, всё равно остается неведомый бинарный проприетарный Skype.", "Если есть желание способствовать по-настоящему благородному делу — созданию открытой реализации протокола Skype можно донатить сюда", "В пост призываются разработчики.", "SDK есть для:", "Все возникающие вопросы можно задать в конференции"]},
{"title": "Skype-бот для голосовых конференций", "text": ["Вероятно, некоторые помнят сервис Skype Casts — публичные голосовые конференции, где каждый мог создать конференцию, которая анонсировалась на сайте skype.com. В 2008 году сервис был закрыт.", "Сегодня единственная возможность хостить конференцию — держать запущенным Skype-клиент.", "Это не удобно, потому как человек, который «держит» конференц-звонок не может принять входящий вызов, иначе конференция будет поставлена на удержание и никто в ней не сможет общаться. Если у хоста проблемы с интернетом — связь портится у всех.", "К тому же хостить звонок в котором 10-15 участников существенно нагружает компьютер.", "Мы пытались решить эту задачу держа запущенным Skype на Windows-сервере. Чтобы звонок не обрывался когда все участники кладут трубку — приходилось запускать две копии клиента и держать второго как участника конференции.", "Но такая схема не очень стабильна, через 3-5 дней один из клиентов вылетает и звонок обрывается. Приходилось каждый переподнимать его вручную.", "И вот наконец удалось найти стабльное и просто решение на основе", "позволяющие:", "Если все участники конференции положили трубки, звонок перезапускается как /golive", "Десктопный клиент требует для запуска X-сервер. Skypekit можно запускать без него, даже на VPS.", "Доступен под все платформы Windows/Linux/Mac", "Бот умеет разграничивать права доступа, различать комманды отправленные из основного чата конференции и из других чатов.", "При желании можно написать аналог irc-шного eggdrop.", "Он стоит 5$. Если денег жалко я могу поделиться своим.", "Компилируем заглушки для видео и звука. это немного неочевидный процесс, поэтому можно спрашивать по ходу).", "и кладем его в {skypekit_dir}/examples/python/tutorial/", "Предпологается, что у вас уже есть созданная конференций в которую будет добавлен бот.", "Нельзя чтобы аккаунт бота был создателем конференции. Команда", "введенная чате конференции вернет логин создателя.", "В строке 38 необходимо вставить ID конференции. Чтобы его получить нужно ввести", "в чате конференции.", "Команда возвращает такую строку", "В скрипт строку необходимо добавлять в таком виде:", "В списке Admins (строка 43) можно перечислить логины тех кто сможет управлять ботом.", "Теперь бот будет держать звонок постоянно.", "Команды в чате:", "!down — прекратить держать звонок", "!up — возобновить звонок", "Молодой парень срочно познакомится с более опытным Python-программистом для серьезных отношений в контексте совершенствования бота, потому как моих навыков явно недостаточно. В перспективе можно сделать полноценный аналог бота eggdrop или аналог сервиса SkypeCast."]},
{"title": "Незакрываемая вкладка в Chrome", "text": ["Не совсем даже баг, скорее недоработка интерфейса позволяет создать страницу, которую нельзя будет закрыть в Google Chrome.", "Пруф:", "В приведенном примере предупреждение будет показано только десять раз, но ничего не мешает показывать его бесконечно.", "смог воспроизвести проблему в IE 10.", "написал:", "Так же в Chrome есть особенность при показе модальных окон. Окно с алертом является глобальным для всех вкладок.", "В результате нельзя переключиться на другую вкладку не закрыв модальное окно.", "Пример", "В сочетании с первой проблемой это позволяет создать ощутимый дискомфорт:", "Осторожно скример: _ttp://wifix.ru/onbeforeunload/screamer.html"]},
{"title": "Доброфон — бесплатные телефонные консультации по любым вопросам", "text": ["Иногда у нас возникает внезапная необходимость поговорить с живым человеком. Спросить совета, получить консультацию, поделиться идеей, рассказать смешную историю или просто поговорить ни о чем. Не всегда бывает удобно беспокоить этим друзей.", "Мы попробовали решить эту задачу и сделали", "– горячую линию куда можно позвонить в любое время и поговорить с реальным человеком тет–а–тет. Операторы разделены на категории в зависимости от квалификации и пола.", "Все, разумеется, бесплатно и создано исключительно для эстетического удовольствия.", "В Доброфон можно позвонить через:", "В статье будет описана техническая сторона организации call-центра и тонкости подключения всех внешних линий.", "Бекенд работает на asterisk. Все входящие линии, соответственно, подключены к нему.", "Операторы подключаются к серверу через SIP.", "Все операторы разделены на три категории и имеют соответствующий трехзначный внутренний номер:", "Все аккаунты занесены статические очереди в queues.conf согласно своей категории. Плюс четвертая категория «случаный оператор» в которой звонок направляется всем операторам сразу.", "Из конфигов asterisk примечательным является только", "При такой конфигурации операторы могут видеть через какую входящую линию звонит пользователь и какую цифру (категорию) он выбрал. Так например при звонке через Skype и выборе случайной категории — оператор видит строку Skype_R в поле CallerID(num) и skype-логин звонящего в поле CallerID(name) в своем sip-клиенте.", "Так это выглядит на стороне оператора в SIP-клиенте eyeBeam:", "Политика дозвона в очередях такова: звонок отправляется всем операторам из выбранной категории одновременно, звонок забирает первый ответивший оператор.", "Операторы могут переводить активный звонок друг другу через blind transfer (решетка и внутренний номер) так и через обычный трансфер (сначала оператор ставит активный звонок на удержание, звонит другому оператору, срашивает «можно я тебе переведу такого-то клиента» и после переводит)", "Наиболее интересной частью является устройство входящих каналов. Я разберу каждый канал в отдельности.", "Ни один из перечисленных ниже провайдеров не платил нам за рекламу (хотя мы и не против), и все описанное является результатом моих личных изысканий.", "Раньше основной Skype-аккаунт у нас был", "Это бизнес-аккаунт подключенный к услуге Skype Connect, по цене 5€ за одну конкурирующую линию (подробно этот сервис описывается здесь", ").", "В процессе использования выяснилось, что Skype Connect это обычный аккаунт с настроенной безусловной переадресацией на номер +990. Это виртуальные номера в сети Skype предназначенные для приземления звонков. Звонки на эти номера возможны только из сети Skype и не тарифицируются.", "Стоимость тарифа Skype Connect формируется из количества необходимых конкурирующих линий. То есть если вы хотите иметь возможность принять 10 параллельных звонков через свой Skype-логин, тариф будет 50€ в месяц.", "Но тут открылся интересный хак: количество параллельных линий лимитируется только самим номером +990 который вам выдают, в то время как Skype-логин никак не ограничивается количество параллельных звонков. Из этого следует что если переадресовывать звонки на другой номер, который, например, покрывается подпиской, можно получить аналог Skype Connect за меньшие деньги. Например купить подписку на городские телефоны Москвы, купить многоканальный номер +7(495) и переадресовывать звонки на него. В таком случае количество параллельных линий будет ограничиваться на стороне SIP-провайдера, и Skype Connect можно вообще не покупать. Так же Skype бесплатно звонит на Toll Free номера в Америке (+1800, +1888).", "Когда-то давно Skype очень плотно сотрудничал с провайдером", ". С тех пор у Voxeo есть пул номеров +990 которые он раздает бесплатно всем желающим через дочерний сервис", "(Этот сервис настолько прекрасен что я расскажу о нем подробно далее). При этом не накладывая жестких ограничений на количество параллельных линий. (На самом деле ограничения есть, но они меряются всплесками при >100 звонков в минуту). Получив такой номер у Voxeo можно изготовить аналогичный SkypeConnect-у аккаунт бесплатно. Правда Voxeo объявил о прекращении поддержки номер +990, так что в скором времени эти номера будут отключены.", "Теперь основной способ дозвона через Skype — это бесплатный номер", "Мы покупаем прямой московский номер", "у", ".", "Прямые номера в этих странах нам бесплатно предоставляет провайдер Voxeo:", "Так же доступны шлюзы в крупных городах", "Наиболее больной вопрос — это звонки через прямо из браузера через Flash.", "Содержать собственный Flash Media Server очень дорого и неудобно. Бесплатные его аналоги вроде RED5 работает очень плохо. Сращивать его с SIP тем более трудоемкая задача.", "Есть несколько провайдеров которые предоставляют услугу Click-to-call виджета для сайта.", "Перепробовав все которые удалось найти, выяснилось, что единственный провайдер который обеспечивает приемлемое качество связи", ".", "У всех остальных ужасное качество звука, задержки, отсутствие у виджета цифровой клавиатуры и другие недостатки.", "Кроме этого, Zingaya, позволяет передавать произвольный CallerID при звонке. Таким образом при звонках из приложения вконтакте, оператор может видеть ссылку на профиль звонящего.", "С недавнего времени Chrome полноценно поддерживает", ". Вместе с этим Zingaya добавили поддержку WebRTC в свой виджет, так что при звонках через хром не используется Falsh и задержки намного лучше.", "Наш номер в сети", ":", "позволяет бесплатно звонить на номера сети iNum.", "Можно также звонить из", "если установить", ".", "С номером iNum можно делать много чего еще интересного, подробнее об этом можно прочесть в гугле.", "Основной SIP-аккаунт:", "Можно также позвонить через внутренние номера некоторых sip-провайдеров. Они перечислены на сайте.", "Просто так. Мы считаем, что человеческое общение одно из наиболее ценных вещей в жизни.", "Добровольцы которым интересно.", "Любой желающий, при наличии микрофона, SIP-клиента и внятной речи может стать оператором. В первой категории, например, много IT-профессионалов которые скучают на работе, так что ее можно использовать как бесплатную тех. поддержку.", "Для того, чтобы получить внутренний номер, нужно написать мне или", "в инбокс", "Так мы занимаемся доброфоном исключительно в свободное время, реализовать все задумки не получается из-за нехватки времени. Поэтому к участию приглашаются все: программисты (asterisk, веб-фронтенд, flash, webrtc), дизайнеры, верстальщики и все остальные кто считает что может чем-либо помочь."]},
{"title": "Определение локальных IP-адресов через WebRTC", "text": ["Через WebRTC можно получить список всех локальных (находящихся за NAT) интерфейсов в системе.", "Пример кода на JavaScript", "Работает только в браузерах поддерживающих WebRTC, на текущий момент это", ".", "Это можно использовать для получения более точного фингерпринта браузера или, например, разоблачения персонажей, сидящих за VPN, чтобы", "Для удобства использования я изготовил js-сниффер, который можно вставить на страницу и удобно просматривать результат его работы:", "Достаточно вставить на страницу код:", "Где test нужно заменить на слово, по которому будет доступен результат работы сниффера:", "Из примечательного в скрипте — определение адресов пользовательского резовлера.", "Скрипт генерирует несколько рандомных поддоменов вида RANDOM.detect.zhovner.com и обращается к ним по HTTP.", "Зона *.detect.zhovner.com делегирована wildcard-ом на NS-сервер, которые логирует запросы резолверов, и при обращении к сайтам возвращает source адрес, с которого пришел резолвер.", "Нужно иметь в виду, что SSL сертификат валидный только для корневого домена, но не для *.detect.zhovner.com, поэтому при встраивании скрипта на https-сайты, будет показано предупреждение о контенте загружаемом не по HTTPS.", "Еще, оказывается, можно обнаружить соседние хосты в сети"]},
{"title": "Игрища с сервером jabber.ru", "text": ["Среди активных", "пользователей Линукс принято осуждать использование любых мессенджеров, кроме джаббера. Однако, мало кто знает, что сервер jabber.ru скрывает в себе множесто «веселых игр» вроде чтения приватной переписки в конференциях. Самые увлекательные развлечения, которые удалось отыскать описаны в этой статье.", "В отличие от нормальных серверов, тут все сделано для людей и их удобства. Например, простой, непривилигированный пользователь может выполнить такой запрос:", "В ответе вам придет полный список зарегистрированных членов конференции. Вашей или не вашей. Приватность не нужна.", "Да, это администраторский запрос, который сделан для редактирования списков пользователей. Но администрация jabber.ru крайне заботливо относится к своим клиентам и позволяет им найти всех своих друзей, даже если у вас нет администраторских полномочий.", "Если вы не разбираетесь в программировании, то представляем вашему вниманию", ", простое и понятное консольное приложение, которое можно рассматривать как фронтенд к игровым сервисам, это приложение сделает вашу игру по-настоящему захватывающей, но одновременно с этим и простой. Найди всех своих друзей и врагов, докажи, что они в интернете не правы!", "Позвольте, но ведь это всего-то список jid, разве можно выразить свою любовь через компьютерный интерфейс?", "Да! Теперь это возможно!", "Например, свою дружбу можно доказать, отправив около 500 запросов на дружбу через запрос авторизации. Современные xmpp-клиенты будут настолько рады, что зачастую будут вылетать от обилия счастья!", "А вот и готовый инструментарий, все опенсорсно и свободно:", "Пусть ваша дружба будет вечной!", "Пожалуй, самой уникальной функцией jabber.ru является… чтение чужой лички! Вы не только сможете читать чужие сообщения, но и даже подменять их!", "Как это работает:", "В настройках конференции вы можете указать сервис (jid) для фильтрации сообщений, как правило, это какой-то бот, который должен быть в конференции. Само собой, если у вас нет такого бота, то вы запросто можете арендовать его в большом количестве конференций, ведь все сделано для людей. Ну или написать самому.", "Боту не нужны админские права, бот просто должен присутствовать в конференции, пусть даже в статусе посетителя. Единственное, что ему нужно — это отвечать на специально сформированные IQ-запросы, разработанные на jabber.ru, что является настоящим эксклюзивом данного сервиса. Попробуйте — и вы не пожалеете! Вы уже хотите?", "Официальная инструкция в бложике jabber.ru:", "Конечно, если вы администратор конференции, то вы наверняка об этом знали и раньше и могли подсматривать в переписку, а что делать простым посетителям, у кого нет администраторских полномочий, а почитать чужую переписку ужас как охота?", "Сервис jabber.ru постоянно борется за звание жаббера высокой культуры быта. И в погоне за высокой культурой останавливаться на только автоматических системах нельзя. Роботы не могут оценить сути происходящего, только настоящий живой человек сможет разобраться.", "Сразу предупреждаю, что если у вас маленькая конференция, до 5 человек, то эта игра не для вас. Эта игра для топовых конференций:", "Если вы в топе, то вас ожидает бесплатный сервис технической поддержки и расширенного обслуживания. Совершенно бесплатно к вам в конференцию зайдет высококвалифицированный специалист и поможет вам управлять вашим же сообществом. Он не только забанит ваших ботов, назначит новых администраторов, обеспечит доступ третьих лиц к приватной информации, но и поддержит беседу на высоком интеллектуальном уровне. Пример:", "Впрочем, если вы хотите воспользоваться этой услугой вне очереди, то напишите на igor@ustyugov.net и вам всегда придут на помощь! А если вас где-то обидели, несправедливо (по вашему мнению) забанили, то тут вас не только разбанят, но и дадут вам администраторские полномочия, и вы с легкостью сможете отвести душу.", "Это очень старая игра, которая со временем потеряла свой захватывающий геймплей, но не потеряла актуальности. Ранее, если в конференцию на jabber.ru написать что-то на арабском языке, то следовал немедленный кик. Так как администраторы плохо знали диапазоны юникода, то кик можно было огрести и за некоторые символы, которые не имеют к арабскому языку никакого отношения. Например, символы юникода, копируемые из комментариев сервиса YouTube.", "Ранее игра была крайне захватывающей: можно было взять себе арабское имя и зайти в любую конференцию. Лучше всего работало в конференциях с ботами, где просто было достаточно написать ping и бОльшая часть конференции отваливалась. Было очень красиво и эффектно.", "Со временем, геймплей изменился. Кик был удален, а текст сообщения заменялся на «I'm arabian pig». Данное признание можно было встретить от многих уважаемых участников совершенно разных конференций. К сожалению, новый геймплей не оценили и продержался он не очень долго, так как администрации грозили судами. Так как это уже не шутки, то вскоре сообщения начали заменяться на \"***\", можете попробовать сами.", "Но даже сейчас очень весело заходить в различные конференции с арабским ником и активно участвовать в дискуссиях. Попробуйте сами!", "Зайти в support@conference.jabber.ru, сообщить о багах, о недоступности сервиса, задать технические вопросы и не получить бан. Конечно, разговаривать надо с официальными представителями, а не рядовыми пользователями.", "Были и другие игры, которые могли бы скоротать ваш досуг. Например, кривой шейпер, который фактически блокировал работу конференции в случае, если один из участников оной отправлял длинную станзу. Были даже люди, которые сначала блокировали конфу, а потом просили выкуп за возвращение доступа. Впрочем, сообщения и сейчас очень часто не отправляются по причине limit rate, даже когда они исходят от легитимных пользователей и написаны живым человеком.", "Генеральный спонсор игр:", "."]},
{"title": "Практическое применение DNSSEC", "text": ["В статье описываются недостатки существующей структуры DNS, полный процесс внедрения DNSSEC на примере доменов .com и .org, процедура создания", "SSL-сертификата подписанного с помощью DNSSEC.", "Система DNS в нынешнем виде была разработана более 20 лет назад, когда о защите информации не особенно задумывались. Она имеет несколько фундаментальных уязвимостей.", "Достоверность ответа DNS-сервера никак не проверяется. Это позволяет отправить пользователя, обратившегося к доменному имени, на произвольный IP-адрес, подменив ответ сервера. На практике подобная атака может выглядеть", ".", "Также уязвимы кеширующие DNS-серверы провайдеров, выступающие как резолверы для клиентов:", ".", "Сегодня существуют технологии, предусматривающие хранение открытых ключей в DNS-записях, например,", "в электронной почте, SSH-ключей в записях", "и т.д. Все эти технологии требуют защиты от подделки DNS.", "DNSSEC — технология, позволяющая однозначно удостовериться в подлинности DNS информации при помощи криптографической подписи.", "Популярно о DNSSEC можно прочитать здесь:", "Более подробно здесь:", "И на сайте", "Перед продолжением настоятельно рекомендуется внимательно прочитать вышеприведенные ссылки, так как на первый взгляд процедура подписания зоны кажется довольно запутанной.", "Максимально упрощенно это выглядит примерно так: есть корневая зона \".\", которая содержит в себе информацию о всех доменах первого уровня. Условно говоря, это текстовый файл с некоторым множеством строк, который изменяется не очень часто. Создается пара открытый/закрытый ключ и каждая строка в этом файле подписывается (по типу «clear sign» в PGP/GPG, которая используется в электронной почте для открытого подписания текста и начинается с «BEGIN PGP SIGNATURE»).", "Теперь, имея открытый ключ от этой пары, можно удостовериться в подлинности каждой записи в этом списке. Например, проверить, что за зону «ru.» действительно отвечают серверы ripn.net:", "В ответе можно увидеть запись RRSIG содержащую хеш-подпись.", "Но этого недостаточно, так как в резолве участвуют нижестоящие серверы, ответы которых тоже нужно верифицировать. Тогда владельцы домена верхнего уровня, например «com.», создают такую же пару ключей и подписывают все записи в своей зоне, и после этого добавляют слепок своего открытого ключа в корневую зону. В результате доверяя открытому ключу корневой зоны можно проверить подлинность ключа зоны «com.» и, соответственно, доверять ему:", "В ответе запись DS содержит слепок ключа, которым подписывается зона «com.»", "Важно понимать, что после каждого изменения в зоне подписание происходит заново. Но, так как корневая зона подписывает только открытый ключ зоны «com.», то нет необходимости перехешировать записи в корневой зоне при каждом изменении в зоне «com.»", "Теперь можно установить подлинность ответов от серверов, ответственных за домен «com.»:", "Видно, что запись о домене verisign.com. подписана, но на этом этапе возможно установить только подлинность адресов NS-серверов, ответственных за домен verisign.com. Для резолва IP-aдреса необходимо получить ответ от них, поэтому владельцы этих NS-серверов имеют свою пару ключей, которыми подписывают зону и помещают слепок открытого ключа в DS-запись.", "Запрашиваем A-запись для домена verisign.com.:", "В результате, для проверки подлинности факта, что А-запись verisign.com содержит значение 192.5.6.31 выстраивается такая цепочка доверия:", "нам заранее известен открытый ключ корневой зоны \".\" и мы ему доверяем. В корневой зоне существует DS-запись о том, что все записи зоны «com.» подписаны указанным в ней ключом и сама запись, соответственно, подписана ключом корневой зоны. Проверив подлинность этой записи, мы доверяем всем записям в зоне «com.», подписанным этим ключом. На серверах, ответственных за зону «com.» содержится DS-запись с открытым ключом verisign.com, подписанная ключом зоны «com.», что позволяет проверить подлинность подписи в ответе NS-сервера, ответственного за verisign.com.", "Схематически это выглядит так:", "Приведенное выше описание достаточно примитивно и нелепо. Оно написано с целью объяснить принцип работы «на пальцах». Вероятно, оно нисколько не упростит понимание, а только еще больше запутает.", "На текущий момент подписаны только некоторые доменные зоны верхнего уровня, в частности: .net, .com, .org.", "Зона .ru до сих пор не подписана, зона .ua подписана в режиме тестирования, зона .su официально подписана, но до сих пор ни один регистратор не поддерживает добавление DS-записей.", "Полный список можно посмотреть на сайте", "Для подписания своей зоны эта возможность должна поддерживаться регистратором домена. На текущий момент мне неизвестны отечественные регистраторы поддерживающие DNSSEC. Регистратор R01 и сайт dnssec.ru, которые рекламирует делегирование доменов .ru с поддержкой DNSSEC абсурдны, потому что сама зона .ru не подписана и, в таком случае, отправной точкой для построения цепочки доверия становится сервер R01.", "Из поддерживающих можно выделить наиболее крупных:", "Неполный список можно посмотреть", ".", "Кроме регистратора, необходимы NS-серверы с поддержкой DNSSEC. Некоторые регистраторы предоставляют такие услуги. Самый дешевый вариант у Godaddy называется Premium DNS 35$/год. Самый дорогой у dyn.com называется DynECT Lite 30$/месяц. В этой статье будет показан пример настройки собственного master DNS-сервера на базе BIND 9.7.3.", "Далее предполагается, что у нас уже есть домен, делегированный на собственные, полностью настроенные DNS, и готовый файл зоны.", "Для включения поддержки DNSSEC в named.conf в секцию options нужно добавить:", "Инструменты для генерации ключей и подписания зон входят в пакет BIND последних версий.", "На этом этапе предполагается, что читателю уже известно что такое ZSK (Zone Sign Key) и KSK (Key Sign Key).", "Все приведенные ниже операции необходимо проводить в отдельно созданной папке.", "Генерация ключа ZSK:", "Генерация ключа KSK:", "где my-domain.com — домен для которого генерируются ключи. В результате выполнения этих команд будут созданы две пары ключей.", "Далее необходимо скопировать файл зоны в текущую папку и выполнить подписание:", "где my-domain.com — текстовый файл зоны. Важно выполнять команду, находясь в одной папке с ключами и файлом зоны; имя файла указывать без пути.", "В результате будут созданы два файла:", "— подписанный файл зоны", "— файл содержащий две DS-записи", "Исходный файл зоны останется без изменений. Далее в конфиге BIND необходимо заменить файл на подписанный:", "Развернутые примеры файлов зон можно посмотреть на", ".", "Чтобы повысить отказоустойчивость своих DNS, рекомендуется использоваться secondary серверы. Cуществует несколько бесплатных сервисов предлагающих slave-серверы с поддержкой DNSSEC. Вот неполный список", ". Я использую rollernet.us, поэтому разрешаю трансфер с адресов 208.79.240.3 и 208.79.241.3. При использовании secondary-серверов, записи о них должны присутствовать в файле зоны еще до подписания. Я рекомендую активировать трансфер уже после того как на master-сервере будет находиться подписанная зона.", "Далее предполагается, что подписанная зона уже размещена на авторитарном NS-сервере и доступна снаружи:", "Команда должна вернуть подписанную зону.", "На этом этапе можно активировать secondary сервера и синхронизировать зону по AXFR.", "Далее необходимо добавить DS-записи в панели регистратора домена. Они были сгенерированы при выполнении dnssec-signzone и находятся в файле dsset-my-domain в таком виде:", "Так выглядит форма добавления DS-записей в панели GoDaddy:", "Необходимо переключиться в «Advanced mode» и скопировать обе строки, предварительно отредактировав. Нужно добавить значение TTL и удалить пробел во второй строке в отпечатке ключа, иначе форма вернет ошибку. В результате копируемые строки должны выглядеть так:", "Записи будут добавлены только в случае если зона на master-сервере доступна и подписана правильно.", "Значения полей в DS-записи:", "86400 — TTL данной записи", "40513 — Key Tag", "5 — Algorithm", "1/2 — Digest Type", "В приведенном выше примере при генерации ключей был использован алгоритм RSA-SHA1, поэтому запись имеет номер пять.", "Таблица номеров алгоритмов:", "Digest Type в приведенном примере у первой записи равен 1, во второй 2.", "Таблица номеров Digest Type:", "У некоторых регистраторов, например Dyn.com, форма добавления DS-записи не предусматривает копирование строк, а требует заполнения всех полей отдельно:", "Из-за того, что у Dyn.com список алгоритмов расположен не по порядку и не отмечен номерами, это вызывает некоторую путаницу. При добавлении через эту форму так же нужно удалить пробел в отпечатке второго ключа.", "После добавление DS-записей можно проверить их появление на серверах, ответственных за домен верхнего уровня. Для домена «com.» это выглядит так:", "В момент, когда это произойдет, можно проверить правильность подписания зоны с помощью", "и", ".", "Напомню, что после каждого изменения в записях зоны, необходимо выполнять подписание повторно. DS-записи при этом обновлять не нужно.", "Если всё правильно, можно переходить к настройке клиентской части.", "Для проверки подписей на стороне клиента, эту функцию должен поддерживать системный DNS, через который происходит резолв адресов. Публичный DNS от Google 8.8.8.8 поддерживает передачу DNSSEC записей, но не производит их верификацию. Подробнее написано в", ".", "Наиболее простой вариант — плагин для", "и", ".", "Плагин позволяет производить резолв в обход системных DNS, имеет свои предустановленные серверы с поддержкой валидации DNSSEC. По умолчанию плагин использует системные DNS, изменить это можно в настройках плагина: выбрать CZ.NIC's или 217.31.57.6", "Для того, чтобы научить утилиту dig проверять подпись, необходимо создать отправную точку в цепочке доверия, создав файл с ключом корневой зоны:", "После необходимо в файле", "удалить строку:", "Если этого не сделать dig вернет:", "Теперь можно проверять подлинность подписей с помощью dig:", "Как настроить рекурсивный резолвер с функцией проверки подписей можно прочитать", "Не смотря на то, что стандарт DNSSEC до сих пор находится в разработке, уже возможно извлекать из него пользу.", "При первом подключении к серверу SSH клиент просит самостоятельно проверить отпечаток публичного ключа сервера и ввести yes, после чего публичный ключ сервера сохраняется в файле known_hosts.", "С появлением DNSSEC публичный ключ может быть помещен в DNS-запись типа SSHFP и, при первом подключении к серверу, проверяться автоматически без запроса. Для активирования этой функции нужно добавить опцию VerifyHostKeyDNS=yes в конфиг SSH-клиента, также необходимо чтобы системный резолвер поддерживал верификацию DNSSEC.", "С помощью DNSSEC можно самостоятельно подписать SSL-сертификат который будет «валидным» в браузере.", "Эта экспериментальная функция на данный момент находится в активной разробтке и пока поддерживается только браузером Google Chrome/Chromium.", "Черновой вариант стандарта:", "Технология разрабатывается сотрудником Google по имени Адам Лэнгли (Adam Langley), он ведет очень интересный блог", ".", "об этой технологии.", "Далее предполагается, что домен для которого генерируется сертификат, может быть подписан DNSSEC.", "Скачиваем dnssec-tls-tools:", "И компилируем:", "Генерация RSA-ключей:", "Создание отпечатка ключа:", "где gencaa.py файл из пакета dnssec-tls-tools.", "Команда вернет строку вида:", "Это DNS-запись, которую необходимо добавить в свой файл зоны, заменив EXAMPLE.COM. своим значением. Если зона еще не подписана, это нужно сделать. Если запись добавляется к уже подписанной зоне, нужно, соответственно, выполнить подписание заново.", "Проверяем правильность ключа в DNS:", "Команда должна вернуть", "После того как запись type27 доступна и подписана, можно сгенерировать цепочку доверия DNSSEC:", "И сам сертификат:", "Подключение сертификата в Nginx выглядит так:", "Из-за того, что цепочка подписания DNSSEC может изменяться, создание цепочки и генерацию сертификата (последние две команды) необходимо добавить в крон и выполнять, например, раз в сутки.", "Результат должен выглядеть так:", "Из-за того, что вся цепочка DNSSEC помещена в сертификат, браузеру нет необходимости производить полную проверку цепочки, так что сертификат будет «валидным» даже в случае если системный резолвер не поддерживает проверку DNSSEC.", "В статье не рассмотрены сроки действия ключей DNSSEC, не рассказано об альтернативной цепочке доверия DLV (DNSSEC Look-aside Validation). Я буду признателен тем, кто разберется в этих вопросах и опишет их.", "Мне известно негативное влияние подобных пошаговых HOWTO, которые приводят к бездумному копированию команд без понимания сути. Но, из-за того, что информации по данному вопросу мало и местами она противоречива, я надеюсь, кому-то эта статья поможет избежать путаницы с которой пришлось столкнуться мне. Спасибо", "за консультации и", "."]},
{"title": "Умный обход блокировок в Украине", "text": ["В статье описывается настройка бесплатного сервиса", "для обхода блокировок сайтов в Украине.", "Особенность конфигурации в том, что через VPN маршрутизируется трафик", ". Работает на всех основных платформах: Windows, Linux, iOS, MacOS, Android.", "VPN не влияет на скорость интернета, не подменяет IP для остальных сайтов и не мешает работе онлайн-игр, голосового трафика и т.д.", "Процесс настройки описан на примере", "и может быть легко повторен за несколько минут.", "Настройки на стороне клиента выполняются с помощью одного файла конфигурации и не требуют ручного ввода адресов и паролей.", "Сервер для VPN должен иметь хорошую связность на сетевом уровне с вашим провайдером, чтобы задержки были минимальными, а также с ресурсами, которые планируется посещать через этот VPN. Датацентры в США, Китае, Японии — не лучший выбор.", "Приведу несколько вариантов, которые я выбрал для сервиса Zaborona.help:", "— крутой и надежный хостинг с хорошими каналами.", "— дешевый хостинг с безлимитным трафиком.", "Для надежности используются сразу несколько серверов у обоих провайдеров. Балансировка выполняется примитивно, на уровне DNS.", "Служебный домен, к которому подключаются клиенты", ", имеет несколько А-записей, направленных на все сервера сразу. Это позволяет равномерно размазать клиентов по серверам. Минимальный TTL записей позволяет быстро убрать проблемный сервер из общего списка и перенаправить клиентов.", "Из", "известен список компаний, подпадающих под блокировки. Зная этот список, можно составить список всех диапазонов IP, принадлежащих этим компаниям", "Для этого можно использовать сервис", "Вот как выглядят BGP-анонсы Яндекса", "Собираем все нужные диапазоны. Соседние сети объединяем в один диапазон, чтобы уменьшить общее число маршрутов на клиенте.", "На выходе получаем такой список без учета IPv6-диапазонов:", "Этот список меняется крайне редко, поэтому не составит труда его обновить при необходимости.", "На сервере будет использован OpenVPN 2.4. Рекомендуется использовать именно эту версию. В репозиториях Ubuntu LTS версия OpenVPN 2.3, поэтому нужную версию можно установить подключив официальный", ".", "Для генерации сертификатов проще всего использовать утилиту", ". Данный форк от", "позволяет генерировать сертификаты, одновременно подходящие и для OpenVPN, и для Ipsec.", "После генерации сертификатов имеем такой список необходимых файлов:", "— корневой сертификат", "— серверный сертификат", "— ключ от сертификата сервера", "— корневой сертификат", "— клиентский сертификат", "— клиентский ключ", "Полученный на предыдущем шаге список сетей добавляем в конфиг сервера. Таким образом при подключении клиенту будут устанавливаться маршруты к заблокированным сетям через VPN сервер. Маршрут по-умолчанию", "при этом не будет изменен.", "Так как многие провайдеры в Украине блокирует DNS запросы к запрещенным сайтам, важно установить клиенту наши резолверы, и сделать так, чтобы доступ к ним был через VPN.", "Складываем все файлы на сервере в в папку /etc/openvpn", "Для настройки подключения на стороне клиента, нужно сгенерировать конфигурационный файл, в котором будут вписаны настройки и ключи аутентификации.", "Процесс настройки подключения на клиенте состоит из двух шагов: установить OpenVPN клиент и импортировать файл с настройками.", "Мы написали инструкции c картинками для всех популярных операционных систем:", "Исходники всего проекта, в том числе сайта, доступны на", ". Если какая-то информация на сайте отсутствует, буду признателен за pull request-ы.", "Тем, кто хочет настроить собственный VPN сервер для обхода блокировок, с удовольствием помогу. Можете задавать любые вопросы здесь, либо в комментариях на сайте."]},
{"title": "Перехват cookie в реальном времени в открытых WiFi-сетях", "text": ["На видео показан угон сессии вконтакте.ру, который почему-то до сих пор не использует авторизацию с https и передает пароли открытым текстом.", "Дамп трафика собирается программой kismac в формате libpcap и параллельно парсится grep-ом с использованием регулярных выражений, что позволяет в реальном времени выводить на экран все интересующие куки и пароли. При этом не используется никаких анализаторов пакетов.", "regexp для перехвата вконтакте.ру:", "для фейсбука:", "Аналогичная конструкция будет работать и с дампом собранным с помощью airdump-ng."]},
{"title": "Незакрываемая вкладка в Chrome", "text": ["Простой трюк позволяет создать страницу, которую нельзя будет закрыть в Google Chrome.", "Пруф:", "Зловредный код выглядит крайне просто:", "В приведенном примере из-за музыки страница перезагружается чуть дольше, и ее можно успеть закрыть.", "Трюк уже используется мошенниками, вымогающими деньги под предлогом блокировки компьютера:", "хттп://stop.podzone.org/stop_ip.php?gorod=Moscow&ip=127.0.0.1&sid=1&br=1"]},
{"title": "Почему ваш любимый мессенджер должен умереть", "text": ["На написание этого текста меня подтолкнула ужасающая ситуация, сложившаяся в области интернет-коммуникаций, угрожающая перспектива развития инструментов для обмена мгновенными сообщениями, аудио-видеозвонками и надоевшие споры о том, какой же мессенджер все-таки хороший, правильный и безопасный.", "Последние годы конкуренция на рынке мессенджеров как никогда высока. Доступный интернет у каждого в смартфоне позволил мессенджерам стать самыми часто используемыми приложениями. Только ленивый сейчас не пишет свой мессенджер. Каждый день выходит новое приложение, обещающее совершить революцию в способах коммуникации. Доходит даже до абсурда вроде приложения", ", позволяющего слать друг другу только одно слово.", "У каждого мессенджера есть своя аудитория, агитирующая пользоваться именно их любимым сервисом. В итоге приходится заводить кучу учетных записей в различных сервисах и устанавливать кучу приложений, чтобы иметь возможность оперативно связаться со всеми необходимыми людьми.", "Сложившаяся на данный момент ситуация настолько ужасна, что в перспективе угрожает фундаментальным принципам общения. В данной статье я на конкретных примерах попытаюсь донести одну мысль:", "Сразу скажу, что я не страдаю опенсорсом головного мозга, и у меня нет фобий по поводу проприетарных продуктов, я сам пользуюсь закрытыми программами и протоколами. Конкретные примеры, описанные ниже, приведены исключительно для демонстрации проблем существующей централизованной архитектуры. Я вовсе не испытываю ненависти к данным продуктам и компаниям, и, напротив, считаю, что они вполне могут эволюционировать. Умереть должна только существующая модель их работы.", "Интернет, каким мы его знаем сегодня, существует благодаря открытым стандартам. Все уровни взаимодействия сети, начиная с физического (кодирование сигнала по проводам, радио, оптическим каналам) и до прикладного уровня приложений (HTTP, E-mail) открыты и доступны для любого желающего. Кто угодно может написать свой веб-сайт, браузер, email-клиент. Для этого не нужно просить чьего-то разрешения, покупать патенты или заключать контракты.", "Именно поэтому мы имеем множество операционных систем, умеющих работать с интернетом, и разнообразие устройств и приложений, поддерживающих популярные протоколы.", "Представьте, что емейл можно было бы отправить только с программы Outlook на такой же Outlook, а на Gmail уже нельзя. И перед отправкой емейла нужно было бы выяснить, какой у получателя почтовый клиент. Или, например, голосовые звонки с мобильного работали бы только между телефонами одного производителя. То есть звонить с Samsung можно было бы только на Samsung. Абсурд, не правда ли?", "Именно так сейчас выглядит ситуация, когда нужно с кем-то связаться в чате или совершить аудио-видеозвонок через интернет. Здесь правят бал коммерческие компании, целью которых является максимальный охват аудитории. Поэтому каждый мессенджер делается изолированным от других, а компании ревностно сражаются за своих пользователей.", "Все дело в том, что в какой-то момент открытые стандарты перестали успевать за потребностями пользователей, и коммерческие компании смогли предложить намного более привлекательные решения. Это обеспечило огромную популярность коммерческим мессенджерам. Так, например, во времена dial-up, такого качества голосовой связи, как у Skype, не мог предоставить никто из конкурентов, да еще и бесплатно! На сегодняшний день, по разным данным, на долю Skype приходится около 40% международных звонков.", "С массовым распространением смартфонов хлынула вторая волна распространения мессенджеров. Люди постепенно сообразили, что платить огромные деньги за одно SMS несправедливо, если за эти же деньги можно чатиться весь день в альтернативном мессенджере. Так, некогда большой рынок SMS-сообщений стал сдуваться.", "Такая же судьба в какой-то момент неминуемо ждет и телефонные звонки. Мобильные операторы это понимают и пытаются как можно дальше оттянуть этот момент. Сперва", "VoIP-сервисы в своих сетях, а потом и вовсе маскироваться под них:", "Вот только мобильные операторы являются частью очень влиятельных телекомов, которым принадлежит значительная доля интернет-каналов. Поэтому, скорее всего, процесс отказа от SIM-карт и голосовых услуг оператора будет мучительным и долгим.", "Однако подвижки в эту сторону уже есть. Разрабатываемый Samsung и Apple стандарт", "позволит выбирать оператора прямо в телефоне, без необходимости вставлять SIM-карту. В итоге процесс подключения к новому оператору будет не сложнее оформления подписки на музыкальный сервис — включил только что купленный телефон, посмотрел список операторов, доступных в данном регионе, выбрал подходящий тариф, оплатил кредитной картой и пошел.", "В таких условиях пользователи захотят всегда сохранять за собой свой номер телефона. Таким номером должен был стать", ", который, как мне кажется, провалился. Возможно, вместо номера телефона будет ID в любимом мессенджере-коммуникаторе. Очевидно, что в этом случае ничего, кроме интернета, от оператора пользователю не нужно. Поэтому общественный запрос на услуги операторов будет звучать примерно так: «Дайте мне доступ в интернет и отвалите со своими дополнительными услугами». Уже сейчас можно видеть негодование пользователей, использующих SIM-карты в планшетах исключительно для интернета, когда операторы впаривают им подписки на платные сервисы, гороскопы, анекдоты, пакеты SMS и т. д. В будущем это ощущение сформулируется более отчетливо.", "Видно, как в таких условиях многократно возрастает влияние мессенджеров. Из альтернативного, мессенджер превращается в доминирующее средство связи. Страшно представить, что будет, если нынешняя тенденция сохранится, и у нас будут сотни изолированных, несовместимых друг с другом программ.", "Для того чтобы понять опасность монополии в технологической сфере, можно взглянуть, например, на бизнес-решения, работающие только в Internet Explorer, из-за чего откровенно плохой продукт вынуждены поддерживать и использовать повсеместно.", "Или на форматы электронного документооборота. Так как момент был упущен, доминирующие позиции занял проприетарный doc, и до сих пор нет единого стандарта электронного документооборота.", "В СМИ часто поднимается вопрос: какой же мессенджер «защищенный» на самом деле? Под этим обычно понимается безопасность транспортного протокола, что в большинстве случаев нелепо, потому как, помимо безопасного протокола, существует еще большое количество сущностей, которые могут содержать уязвимости.", "Безопасен или нет конкретный мессенджер – вопрос неправильный, пока не обозначена конкретная угроза. Безопасность — это не готовый продукт, а целый комплекс технологий и архитектуры, и рассматривать каждую угрозу нужно отдельно.", "Я пользуюсь Skype уже около десяти лет. У меня это вторая по частоте использования программа после браузера.", "Для меня Skype — большее, чем просто IM, я веду в нем рабочие переговоры, общаюсь с друзьями, завожу новые знакомства в публичных skype-конференциях.", "Skype полностью заменяет мне социальные сети, у меня даже нет аккаунта в VK и Facebook, потому что мне приятней видеть и слышать собеседника.", "Я по максимуму пользуюсь всеми возможностями Skype: групповые видеозвонки, демонстрация рабочего стола, чаты, пересылка файлов, звонки на обычные телефоны, SMS, аренда прямых номеров, подписки.", "Я попробовал все инструменты Skype для разработки: Skype4Com, SkypeKit SDK.", "У меня есть опыт работы с решениями Skype для интеграции с бизнес-системами VoiP, такими как Skype for Asterisk и Skype Connect.", "Я активно пытался улучшить Skype, писал отчеты о проблемах и найденных уязвимостях в bug tracker, пока его не закрыли. В частности, я нашел две критические ошибки, позволяющие удаленно вызвать завершение клиента Skype под Windows.", "Я по-настоящему", "любил Skype, и, как мне кажется, имею достаточный опыт и моральное право, чтобы писать все это.", "На сегодняшний день Skype — самая продвинутая программа в своем классе, которая на порядок превосходит всех ближайших конкурентов, и вот почему:", "Такое большое внимание уделено Skype потому, что его можно считать флагманом в индустрии мессенджеров-коммуникаторов. У него самый богатый функционал и конкурентам еще очень далеко до него. При этом он самый старый и имеет отчетливые симптомы, указывающие на необходимость его ликвидировать.", "Проблемы Skype, так или иначе, можно отнести ко всем популярным мессенджерам. Я не стану рассматривать его ближайшего конкурента Viber, потому что не имею достаточного опыта использования.", "Я рассмотрю Telegram отдельно, так как его принято считать мессенджером, принципиально отличающимся от конкурентов, и не страдающим недостатками Skype, Viber, WhatsApp. Он преподносится как долгожданная защищенная альтернатива всем существующим мессенджерам. СМИ разрекламировали его как средство связи, которым спокойно пользуются даже террористы, настолько он безопасен. Однако, в большинстве случаев, безопасность рассматривается как отдельная сущность без рассмотрения конкретных видов угроз, что в корне неправильно.", "Я сам постоянно пользуюсь телеграмом, и нужно признать, что он действительно прекрасен в плане юзабилити. Ни от одного другого мессенджера я не был в таком восторге. Чего только стоит его стабильность при плохом интернете. В среде с плохим сигналом, где едва ловит GPRS, ни один другой мессенджер не работает настолько хорошо. Но когда речь заходит о безопасности и исключительности Telegram, нужно признать, что он страдает всеми теми же симптомами, что и конкуренты.", "В итоге, несмотря на то что Telegram сделан очень хорошо, и в большинстве случаев намного безопаснее и удобнее аналогов, его никак нельзя назвать качественно отличающимся решением от конкурентов. Это все такой же коммерческий продукт, несущий в себе угрозы для свободы общения.", "Все вышеописанные симптомы, в той или иной мере, касаются большинства топовых мессенджеров, известных на сегодняшний день. Централизованная архитектура и управление одной компанией — самый большой гвоздь в крышку гроба каждого из них. Поэтому нет смысла описывать подробно недостатки каждого в отдельности.", "Когда нужна реальная безопасность, все-таки приходится пользоваться старыми добрыми опенсорсными протоколами.", "Для голоса это — SIP + ZRTP, а для текста — XMPP + OTR. Но на фоне всех коммерческих сервисов, можно сказать, что данные протоколы чаще не работают, чем работают.", "Для меня выглядит диким, что, во многих случаях, при звонках через SIP можно получить голос в одну сторону, проблемы с входящими или исходящими звонками и еще целую кучу проблем, которых лишены все коммерческие решения. Мне абсолютно не хочется думать о типе NAT, используемом в данной сети, накручивать ICE или STUN, прокидывать порты, когда просто нужно позвонить. Это отвратительно.", "Похожая история с Jabber. Как вообще можно представить, что в 2016 году сообщения могут просто потеряться из-за разрыва соединения с сервером? Где нормальное подтверждение доставки и прочтения? Jabber абсолютно ужасен в среде с нестабильным интернетом и на мобильных платформах.", "Пока все эти проблемы не будут решены, нельзя даже и говорить о конкуренции открытых протоколов с коммерческими мессенджерами. Я был бы рад, если бы на сегодняшний день существовало хоть одно открытое решение, достойное занять место доминирующего мессенджера-коммуникатора в мире. Но такого нет.", "Я искренне считаю, что эта тема крайне серьезна и важно не упустить момент. Нельзя допустить, чтобы фундаментальная возможность общения между людьми была кем-то захвачена, как-либо ограничена, и потенциально уязвима.", "Таким важным для человечества вопросом, как разработка единого стандарта мгновенных сообщений и звонков, должны заниматься организации вроде", "вместе с ведущими IT-компаниями.", "Хорошим примером является история с OpenSSL. В момент обнаружения уязвимости heartbleed, все были в ужасе, насколько беззащитной оказалась вся индустрия из-за одной ошибки. После чего была создана организация", ". В нее входят крупнейшие IT-компании вроде Cisco, Google, Intel. Целью этой организации является поддержание критически важных для индустрии программ, таких как OpenSSL, GnuPG, Network Time Protocol и других.", "Надеюсь, важность открытых инструментов коммуникации будет осознана раньше, чем будут обнаружены фатальные проблемы в существующих проприетарных продуктах, и подобная организация будет вовремя создана для работы над нужными стандартами.", "Протокол интернета позволяет связаться любому узлу с любым другим узлом в интернете. На сегодняшний день это не совсем справедливо из-за проблем ipv4, но представим, что прошло пару лет и у всех уже есть ipv6, и у каждого устройства в любой момент времени, при наличии связи, есть реальный маршрутизируемый IP-адрес. Это позволит любому устройству, будь то смартфон или компьютер, связываться друг с другом без помощи компаний, предоставляющих сервисы для общения. Достаточно только найти способ сообщить нужному собеседнику свой текущий IP-адрес.", "Добавим к этому наличие аппаратной поддержки криптографии во всех мобильных устройствах, позволяющей без особых затрат батареи использовать шифрование.", "Пока подобные идеи реализовываются в виде прототипов, слабо пригодных для повседневного использования, однако ситуация с каждым днем меняется. Некоторые реализации уже можно попробовать.", "Наверное, самый продвинутый на текущий момент инструмент, приближающий P2P криптоанархию. Это полностью децентрализованный мессенджер-коммуникатор, с функциями передачи голоса, видео, демонстрации экрана, конференций. Все коммуникации по умолчанию шифруются и передаются напрямую между пользователями без серверов. Есть клиенты под Windows/Linux/OSX/Android. К сожалению, реализация клиентов сыровата местами, и некоторые функции не работают между разными платформами, но они активно развиваются. Хочу сказать спасибо", "за продвижение TOX на хабре.", "Бывший SIP-клиент SFLphone. Теперь умеет работать в 3 режимах: как обычная SIP-звонилка (централизованная), как федеративный сервис (с self-hosted сервером, который может связываться с остальными серверами) и полностью децентрализовано.", "Грубо говоря, с этой штукой можно звонить по SIP через DHT. К сожалению, клиент под OS X еще сыроват и полноценно воспользоваться им у меня не получилось.", "Наверняка существуют еще реализации, но реально работающих я больше не знаю.", "Эти реализации сильно далеки от идеала и простым пользователям, скорее всего, они не понравятся.", "Нужно признать, что успешность конкретного продукта — это не только продвинутые технологии, но еще и юзабилити, дизайн, удобство использования и простота. Вероятно, прежде, чем подобные технологии приживутся, пройдет еще множество итераций различных протоколов.", "Я не готов сказать, каким именно должен быть идеальный протокол, но попытаюсь сформулировать основные требования:", "Я не призываю в срочном порядке отказываться от использования вашего любимого мессенджера. К сожалению, достойной замены коммерческим продуктам на сегодняшний день нет, и пока приходится пользоваться тем, что лучше решает поставленную задачу. Цель данной статьи обратить внимание на серьезную проблему, которая ждет нас в будущем, если сегодня не будут предприняты меры. Также это попытка ответить разом на все споры о том, какой же мессенджер лучше и почему стоит скептически относиться к новостям о том, что очередная компания сделала очередной супер мега мессенджер, теперь уж точно правильный и безопасный."]},
{"title": "Перехват PPPoE сессии", "text": ["На видео показан практический способ угона сессии PPPoE с помощью врезки в кабель. При этом не происходит перехвата логина или пароля и не имеет значения используемый тип авторизации (CHAP/PAP).", "Большинство ethernet-провайдеров, к сожалению не используют шифрование всей сессии, ограничиваясь только шифрованием этапа авторизации. Это позволяет представиться легитимным клиентом, перехватив реквизиты существующего подключения.", "(Point-to-Point Protocol over Ethernet) — протокол канального уровня, на уровень ниже ip, поэтому для установки соединения не требуется ip-адреса, адресация происходит по MAC-ам.", "Условно процесс подключение выглядит так:", "Клиент в поисках pppoe-сервера посылает широковещательный запрос,", "MAC-адрес назначения FF:FF:FF:FF:FF:FF.", "Сервер отвечает клиенту и происходит авторизация (например CHAP Challenge)", "В установленном соединении сервер идентифицирует клиента по MAC-адресу и Session ID. Пакеты IP инкапсулируются внутрь кадров PPPoE. В незашифрованном подключении всё содержимое пакетов может быть просмотрено:", "Соответственно, узнав реквизиты подключения, можно перехватить сессию:", "Для защиты от подобных атак существует опция CHAP Rechallenge, когда сервер повторно идентифицирует клиента с заданным интервалом времени. Ни один из протестированных провайдеров не использовал эту опцию.", "В видео используется виртуальная машина, запущенная в режиме моста с ethernet картой хост-системы.", "Во время переключения кабеля важно попасть между пакетами LCP-echo.", "PPPoE-сервер", "перекомпилированный с опцией", "Спасибо", "за помощь в ковырянии исходников сервера rp-pppoe."]},
{"title": "Прямой московский номер в Skype", "text": ["В статье будет описан способ подключить прямой московский номер в Skype с бесплатными входящими", "Вместе с прямым московским будут доступны шлюзы в крупных городах России, Украины, Великобритании, США и других, через которые можно принимать входящие вызовы, используя добавочный пятизначный префикс, и, если нет необходимости в прямом номере, решение будет полностью бесплатным.", "Для этого будут использованы два sip-провайдера и собственный сервер asterisk для коммутации.", "Схема имеет смысл только в случае, если важно принимать входящие звонки именно в скайпе, иначе, можно использовать обычный sip-клиент и упразднить три последние части схемы.", "Кроме этого, существует большое количество операторов, которые предоставляют такую услугу «из коробки», но стоит это несоизмеримо дороже и часто с тарификацией входящих звонков.", "Принцип таков: первый оператор предоставляет прямой номер +7901, сервер asterisk подключается к нему как sip-клиент и все входящие вызовы перенаправляет на sip id второго провайдера, у которого есть шлюз sip => skype и в панели управления настроено перенаправление входящих вызовов на скайп.", "Первый, тот который продает прямой номер —", "Регистрируемся, выбираем тариф «Эконом» — это тариф без абонентской платы.", "В меню", "подключаем номер, он станет активен после минимального пополнения счета в 1,25 $. Для сохранения номера необходимо пополнять счет каждые два месяца на любую сумму (отсюда вся стоимость в 7,5$ в год).", "Можно обойтись и без пополнения счета. Вы уже можете принимать входящие звонки через шлюзы с добавочным номером. Список шлюзов есть в панели управления либо тут", "Далее в меню", "сохраняем свой пятизначный sip id (именно он является добавочным префиксом при звонке через шлюзы) и пароль.", "Второй оператор, который предоставляет переадресацию из sip в skype —", "Регистрируемся. Аккаунт будет действовать 30 дней. Чтобы сделать его постоянным нужно либо зарегистрировать свой мобильный номер либо пополнить счет на минимальную сумму.", "В меню", "ставим галочку «", "» и вводим скайп-логин в формате username@skype.sipnet.ru. Так же необходимо добавить в контакт-лист скайпа логин skype.sipnet.ru.", "Запоминаем свой десятизначный sip id.", "Для тех, у кого нет возможности/желания крутить астериск у себя, я могу поделиться своим и подключить ваши аккаунты, благо, ресурсов на телефонию расходуется не много.", "Далее предполагается, что астериск установлен на сервере с реальным IP. Конфиги выглядят так:", "Проверить успешно ли настроен asterisk можно в панели zadarma.com -> sip-настройки. Транк должен быть online, user agent — тот, который был указан в sip.conf", "Смотреть отладочную информацию можно, подключившись к консоли астериска:", "Если всё настроено правильно, при звонке на ваш sip id в zadarma должен происходить входящий вызов в скайпе от контакта skype.sipnet.ru"]},
{"title": "Уязвимость позволяющая слышать собеседника с выключенным микрофоном", "text": ["Уязвимость позволяет активировать выключенный микрофон собеседника без его ведома. При этом пиктограмма микрофона останется перечеркнутой.", "Ошибка находится в функции автоматического восстановления связи при обрыве в режиме группового звонка. Проверено на Windows-версиях 5.5.0.124, 5.6, BETA 5.7.0.123.", "Шаги чтобы воспроизвести ошибку:", "При звонках тет-а-тет ошибку воспроизвести не удалось.", "Тикет", "Разработчики подтвердили ошибку."]},
{"title": "DoS эксплоит для движка WebKit", "text": ["Определенная последовательность арабских символов позволяет вызвать критическую ошибку, приводящую к аварийному завершению любого приложения использующего движок WebKit", ".", "Уязвимость воспроизводится на Mac OS 10.8 (Mountain Lion) и iOS 6. Версии iOS <6 и 7 beta, Mac OS <10.8 и 10.9 beta не подвержены проблеме.", "Ссылка на эксплоит:", "Уязвимость можно воспроизвести:"]},
{"title": "Как Skype уязвимости чинил", "text": ["В статье описываются мои безуспешные попытки убедить сотрудников Microsoft, что их сервис уязвим, а также унижения, которые приходится выносить пользователям Skype. Под катом невежество, боль и отчаяние.", "Статья на английском", "Пост на HackerNews", "TL;DR:", "Я пользуюсь скайпом около десяти лет. Раньше я мог назвать себя настоящим фанбоем скайпа.", "Когда был доступен публичный баг-трекер jira.skype.com, я активно пытался улучшить Skype, рапортовал о багах.", "Например, SCW-2778 Remote DoS exploit. Эта уязвимость позволяла удаленно обрушить десктопную версию Skype для Windows так, что программа не запускалась без очистки истории.", "Или SCW-3328, которая позволяла удаленно включить отключенный микрофон во время звонка.", "Уже тогда Skype настораживал своим подходом к исправлению багов. Мне приходилось буквально умолять разработчиков исправить проблему, которую не могли починить годами!", "Я пользовался всеми продуктами Skype, инструментами для разработки Skype4Com, Skypekit. Покупал premium-подписки. Продвинул на работе идею купить Skype For Business. Писал ботов, сервис для", "и т.д.", "Но сегодня могу сказать, что я искренне", "Skype. Это отвратительный сервис, погрязший в бюрократии и невежестве сотрудников, абсолютно игнорирующий проблемы и занятый только созданием 3D Видеосмайлов. На сегодняшний день Skype не просто не безопасен, он", ", потому что его механизмы обеспечения безопасности не работают.", "Уже на протяжении нескольких лет существуют уязвимости, приводящие к блокировке произвольного Skype-аккаунта. Их несколько, ими активно пользуются злоумышленники и предоставляют в качестве сервиса.", "Раньше я много писал про уязвимости скайпа, и ко мне стали обращаться жертвы блокировок, которые находили меня через поиск.", "Я видел разные случаи блокировок Skype-аккаунтов. Пытался помочь людям восстановить доступ и умолял Skype сделать с этим хоть что-то.", "Обычно это были блокировки через массовые жалобы. Это давно известный способ, который существует уже много лет. Он настолько старый, что стал частью детской субкультуры, ведущей войны друг с другом в Skype. Но за последний год случилось нечто вопиющее, о чем я не могу молчать.", "В Skype аккаунт блокируется автоматически, если на него поступило достаточное количество жалоб от других пользователей. Предположительно, более 20 штук.", "Для того, чтобы отправить жалобу, не нужно даже добавлять аккаунт в контакт-лист, это можно сделать, найдя аккаунт через поиск и кликнув «заблокировать → сообщить о нарушении».", "Таким образом, жертва может не знать об отправленных в ее адрес жалобах.", "Этой технике уже много лет. О ней писали", ", о ней знают даже дети, которые собираются в группы для совместного накручивания жалоб.", "Вот, например, найденные беглым поиском по vk.com:", "Таких сообществ много и в самом Skype. Существует даже отдельная субкультура «вкачивателей». Обычно это дети 12-19 лет, которые объединяются в кланы. Суть их деятельности состоит в максимальном нанесении вреда оппоненту, который выбирается случайным образом.", "Основные баталии происходят в виде словесных дуэлей в групповых звонках. Смысл в том, чтобы максимально унизить собеседника за короткий период времени и зафиксировать это на видео.", "Некоторые кланы вкачиваетелей выпускают свой фирменный софт для автоматизации вредоносной деятельности.", ". Получается подобие ботнета из собственного контакт-листа, который добровольно абузит присланные аккаунты. Напомню, что для жалобы не нужно добавлять аккаунт жертвы к себе в контакты. То есть на вас может пожаловаться сотня школьников, с которыми вы никогда не общались, и вы этого не узнаете.", "Я лично знаю десяток жертв, чьи аккаунты были удалены таким образом. На все обращения в поддержку Skype отвечают стандартной отпиской:", "Перевод", "Угадайте, исправлена ли эта уязвимость на текущий момент? Конечно же нет!", "Осенью 2015 года мне стали писать люди, пострадавшие от нового вида атаки. На этот раз перед блокировкой аккаунта жертве приходили письма от Microsoft с восьмизначным кодом. Письма были отправлены с ящика verifyme@microsoft.com и имели корректную DKIM-подпись, то есть были точно от Microsoft.", "Проведя с друзьями собственное расследование, мы нашли исполнителя атаки. Его объявлениями были заполнены все форумы для малолетних кулхацкеров.", "Вот его реквизиты:", "Вот одно из объявлений удалятора:", "Чтобы проверить, как происходит удаление, я заказал у него удаление моего тестового аккаунта.", "Для чистоты эксперимента были соблюдены такие условия:", "На протяжении всего процесса удаления я мониторил почтовый ящик и был авторизован в десктопном Skype клиенте.", "Через несколько часов после оплаты на почту посыпались письма с Microsoft Security Code, как на скриншоте выше.", "За 10 часов пришло 24 письма с кодами. Забегая вперед скажу, что атакующий в итоге угадывал код подтверждения.", "Вот все коды из писем, пришедшие за время атаки, с привязкой ко времени получения письма.", "Видно, что отправка происходит короткими всплесками в пределах нескольких минут.", "После того, как письма прекратились, в профиле аккаунта удалились личные данные (имя, фамилия, пол). Остался только логин. В настройках аккаунта на сайте skype.com почтовый ящик сменился с моей почты на deleted@skype.com. Меня разлогинило из десктопного клиента.", "На тот момент мы имели следующие данные:", "Из этого не было понятно, как именно происходит удаление. Не удавалось найти форму, которая генерирует письма с Microsoft Security Code. Ничего не оставалось, кроме как пытаться выудить информацию у взломщика. Мы с друзьями продолжили заказывать удаление тестовых аккаунтов, и в один момент взломщик, в качестве доказательства выполнения атаки, показал скриншот, на котором оператор техподдержки подтверждает, что аккаунт успешно удален:", ".", "Это была форма Live Chat Support, доступная аккаунтам с подпиской. Найти ее можно на сайте skype.com, пройдя несколько раз мастер решения проблем. Если выбирать все время «проблема не решена», то на последнем шаге предлагается открыть чат.", "Чат открывался со стороннего домена", ". Из описания на сайте видно, что это сторонняя компания, предлагающая услуги поддержки для вашего продукта.", "В итоге процедура удаления аккаунта через чат тех. поддержки выглядела так:", "Забавно, что в форму чата с поддержкой передается логин, под которым был авторизован клиент на skype.com. То есть оператор, в теории, должен видеть, с каким именно пользователем он общается. От того особенно странно, что можно назвать совершенно любой аккаунт для удаления и оператор послушно согласится начать процедуру удаления.", "В этот момент все еще неясно, как конкретно атакующий успешно завершает процедуру удаления.", "Уязвимость очевидна. Бежим кричать тревогу в Skype.", "Ведь такую серьезную уязвимость обязательно должны исправить, не так ли?", "Так как у Skype нет каких-то публичных контактов для сообщений об уязвимостях,", "на форум. Никто не реагирует, зато в теме отметились другие жертвы этой атаки.", "Через друзей мне удалось связаться напрямую с сотрудниками Microsoft. Я подробно описал все этапы уязвимости, приложил скриншоты, листинги кодов. Меня заверили, что начато внутреннее расследование. Серьезная компания ведь.", "Однако спустя месяц ко мне снова обратились новые жертвы этой атаки. Сотрудники Microsoft сообщили, что расследование еще не закончено.", "Пробую написать в", ". Это специальный ящик для быстрого реагирования на критические уязвимости. Гарантируется ответ в течение 24 часов. В письме я подробно описываю этапы удаления аккаунта со скриншотами.", "Ответ Microsoft Security Response Center:", "Вольный перевод:", "Раз в неделю я спрашивал, как продвигается расследование у ребят из Microsoft, на что получал ответ, что результата нет. Так продолжалось около", ".", "Было достоверно известно, что атакующий называет правильный код оператору. Иногда со второй-третьей попытки. Стыдно признаться, но мне так и не удалось выяснить как, именно это происходило. Сперва мне казалось, что код генерируется от времени, и поэтому атакующий пытается запросить как можно больше кодов в течение одной минуты, что видно по времени получения писем, но я не смог найти зависимости кода от времени. Возможно, был уязвим сам сервис чатов liveperson.net.", "Недавно Skype отказались от сервиса liveperson.net, и чат с агентом поддержки происходит на домене microsoft.com. Процедура удаления скайп-аккаунта теперь недоступна оператору тех. поддержки, и ее нужно выполнять самостоятельно", ".", "Наверное, тут вы подумаете, что уязвимость закрыта. Как бы не так.", "Спустя год после описанных выше событий, ко мне снова обратились жертвы нашего удалятора скайпов. Теперь письма с Security Code не приходили, очевидно был найден другой способ.", "Признаться, мне вся эта история уже порядком надоела. Я устал умолять, унижаться и выпрашивать исправить уязвимости по многу месяцев.", "Как я уже говорил, я пользуюсь скайпом около десяти лет. Моему основному аккаунту", "примерно столько же. Мне показалось, что будет нечестно только смотреть на страдания других людей, не пережив этого самому. Тогда я решил провести эксперимент и заказать сразу удаление своего аккаунта.", "Стоимость работ — 2 тысячи рублей (примерно $30). На этот раз удалятор обозначил три дня на выполнение работы. И действительно, через несколько дней меня разлогинило из скайпа, и больше я не мог в него войти.", "Сразу после блокировки аккаунта я написал в техподдержку Skype. Предположив, что аккаунт был заблокирован старым добрым способом через массовые жалобы, я подробно описал ситуацию.", "Оригинал переписки можно посмотреть здесь:", "(Читать сверху вниз)", "Я рекомендую прочитать именно оригинал, чтобы ощутить полностью унижение, которое испытывают невинные жертвы блокировок.", "Краткая выдержка из переписки:", "На текущий момент, прошло", "с момента блокировки моего аккаунта. Из переписки с поддержкой видно, что возвращать его не собираются. Но я все-таки рассчитываю его вернуть, и получить извинения от Skype за все унижения, которые мне приходится терпеть, пытаясь сделать их сервис безопаснее.", "К сожалению, Skype на сегодняшний день — огромная неповоротливая бюрократическая машина, которая из-за своих размеров и плохой организации не способна выявлять и реагировать на проблемы. Я сильно сомневаюсь, что в ближайшее время что-то изменится.", "В статье описаны уязвимости, которые известны", ". По опыту, можно предположить, что существует еще огромное число проблем, о которых я просто не знаю, и которые активно эксплуатируются.", "Важно понимать, что таким проблемам подвержен", "мессенджер с централизованным управлением, где вся безопасность строится на доверии к администрации.", "Если вы считаете, что ваш любимый мессенджер более безопасен чем Skype, потому что его сотрудники хорошие ребята, то это большое заблуждение.", "Люди, которые имеют неограниченный доступ к информации всех своих пользователей, могут быть уязвимы к давлению, шантажу или обману. Вряд ли кто-либо готов сидеть в тюрьме или отдать жизнь за сохранность сообщений своих пользователей. И пока существует такой неограниченный доступ, всегда будет соблазн этот доступ использовать неправомерно.", "По-настоящему безопасный мессенджер должен быть построен не на доверии к какой-то группе людей, а на невозможности неправомерного доступа к информации на уровне спецификации."]},
{"title": "Картинки в чате skype", "text": ["Оказывается, в чате скайпа работают некоторые HTML-теги, в том числе и", "Благодаря этому возможно создавать несложные картинки в тексте сообщений.", "Список поддерживаемых в скайпе тегов", "Для того чтобы оправить HTML-код в чате нужно зажать CTRL+SHIFT и кликнуть на кнопку отправки сообщения.", "Код картинки", "Ниже показан пример генерации HTML-кода из изображения на PHP.", "Код достаточно примитивный, потому как обрабатывается каждый пиксель, даже если подряд идут несколько пикселей одного цвета. Если оптимизировать код, таким образом, чтобы генерировать более компактный HTML, возможно создавать картинки более высокого разрешения. Всё упирается в максимальный размер сообщения в skype — 29,999 символов (символ █ считается за три обычных).", "Работает только в Windows версии.", "Попробовать можно тут", "Будем рады если кто-то сможет оптимизировать код для генерации картинок бОльшего разрешения.", "Написал версию на .NET с возможностью создавать картинки 40х40 пикселей но с инвертированием цветов", "Написал реализацию на .NET генерирующую оптимизированный HTML-код с возможностью регулировать конечный размер и возможностью уменьшение количества цветов", "Это позволило создавать огромные картинки (первая сгенерирована моим алгоритмом)", "В новой версии скайпа 5.8.0.154 больше нет возможности отправлять HTML. Но при этом код отправленный с версии младше, отображается в новой версии нормально. Для отправки кода нужна версия ≤5.7"]}
]